<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Einh&uuml;llende aufzeichnen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Konstruieren">
        <PARAM NAME="Keyword" VALUE="Einh&uuml;llende">
</OBJECT>

<A NAME="idh_cm_MakeEnvelop"></A>

<H2>Einh&uuml;llende aufzeichnen&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/toolenvelop.bmp" ALT="" BORDER=0></H2>
<HR>

<P>Klicken Sie zun&auml;chst mit der Maus diejenige <B>Gerade</B> an, deren Einh&uuml;llende Sie erzeugen wollen, die sogenannte ”Generator-Gerade”. Danach k&ouml;nnen Sie wie im gew&ouml;hnlichen Zugmodus an einem <A HREF="JavaScript:HHCTRL.TextPopup(pop_baseobj,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Basispunkt</A> (dem ”Zugpunkt” der Einh&uuml;llenden) ziehen, von dem die Generator-Gerade abh&auml;ngt. Wenn die Generator-Gerade bei diesem Vorgang bewegt wird, hinterl&auml;sst sie eine Serie von Spurgeraden, die ihre <B>alten Positionen</B> markieren. Sobald Sie nach dem Verziehen des Zugpunktes die linke Maustaste wieder loslassen, wird die Einh&uuml;llende als (m&ouml;glichst) glatte Kurve an die aufgezeichneten Spuren der Generator-Geraden gezeichnet, und zwar so, dass alle Spurgeraden Tangenten an diese Kurve sind.</P>

<p>Der Zugpunkt kann auch durch ein Zahlobjekt ersetzt werden: statt an einem Basispunkt zu ziehen, k&ouml;nnen Sie auch an dem Einstellknopf eines Zahlobjektes ziehen, wenn nur die Lage der Generatorgeraden von diesem Zahlobjekt abh&auml;ngen.</p>
<br>

<P><b>Bemerkungen:</b>
<ol start="1" type="1">
<li>
Das <A HREF="JavaScript:HHCTRL.TextPopup(pop_contextmenu,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Kontextmen&uuml;</A> einer Ortslinie zeigt neben den &uuml;blichen Eintr&auml;gen zus&auml;tzlich die folgenden Men&uuml;punkte:<br>
<br>
<UL>
<LI><B>Dicke Linie</B> bzw. <B>D&uuml;nne Linie</B>:<br>
<ul>zum Umschalten der Linienst&auml;rke;<BR></ul>
</LI>
<LI><B>Als Punkte-Serie zeigen</B> bzw. <B>Als Kurve zeigen</B>:<br>
<ul>zum Umschalten der Darstellungsart;<BR></ul>
</LI>
<LI><B>Geradenschar zeigen / verbergen</B>:<br>
<ul>zum Ein- bzw. Abschalten der Ansicht der erzeugenden Geradenschar;<BR></ul>
</LI>
<LI><B>H&uuml;llkurve zeigen / verbergen</B>:<br>
<ul>zum Ein- bzw. Abschalten der Ansicht der H&uuml;llkurve.<BR></ul>
</LI>
</UL>
<br>
Dabei wird der Men&uuml;punkt "<i>Geradenschar verbergen</i>" nur angeboten, wenn die H&uuml;llkurve sichtbar geschaltet ist. Umgekehrt erscheint der Men&uuml;punkt "<i>H&uuml;llkurve verbergen</i>" nur dann, wenn die Geradenschar angezeigt wird. Es muss also zu jedem Zeitpunkt mindestens eine der beiden Darstellungsarten aktiv sein.<br>
<br>
</li>
<li>
Direkt nach dem Erzeugen einer Einh&uuml;llenden wird die Geradenschar der Spuren zun&auml;chst verborgen. Sie k&ouml;nnen Sie aber jederzeit &uuml;ber das Kontextmen&uuml; wieder sichtbar schalten.<br>   <br>
</li>
</ol>
</P>

<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="ortslinie.htm">Ortslinie aufzeichnen</a></li
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>