<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Geometria</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Exportieren">
        <PARAM NAME="Keyword" VALUE="Geometria">
        <PARAM NAME="Keyword" VALUE="Speichern">
</OBJECT>

<A NAME="idh_geometria"></A>

<H2>Geometria von Dr. Timo Ehmke</H2>
<HR>

<P><B>Geometria</B> ist ein JAVA-Programm, mit dem Sie interaktive HTML-Seiten zur Geometrie erstellen k&ouml;nnen. Die Vielfalt der verf&uuml;gbaren Funktionen geht weit &uuml;ber das hinaus, was der DynaGeoX-Viewer kann. So bietet Geometria z.B. dynamische Ver&auml;nderungen der Zeichnung in Abh&auml;ngigkeit von Benutzereingaben sowie die M&ouml;glichkeit, Animationen geometrischer Zeichnungen zu programmieren. </P>

<P>Aufgrund der Unterschiede in den Datenstrukturen von Geometria und EUKLID DynaGeo sind derzeit beim Export die folgenden Inkompatibilit&auml;ten zu beachten:</P>

<UL>
        <LI><B>Strecken fester L&auml;nge</B> werden von Geometria nicht unterst&uuml;tzt; sie werden daher als gew&ouml;hnliche Strecken zwischen 2 Punkten exportiert.<BR><BR></LI>

        <LI>Es sind nur <B>Abst&auml;nde eines Punktes</B> zu einem anderen Punkt oder einer Geraden oder einem Kreis erfolgreich exportierbar. Zudem muss im letzten Fall der Punkt <U>au&szlig;erhalb</U> des Kreises liegen.<BR><BR></LI>

        <LI>Von den <B>Linienattributen</B> werden nur die Farben korrekt &uuml;bernommen. Linienstile (wie fett oder gestrichelt) werden von Geometria nicht unterst&uuml;tzt, daher werden alle Linien als d&uuml;nne, durchgezogene Linien exportiert.<br><br></LI>

        <li>Teilverh&auml;ltnisse werden derzeit von Geometria noch nicht unterst&uuml;tzt. Bitte vermeiden Sie Terme, die Teilverh&auml;ltnisse enthalten.<br><br></li>
</UL>

<P>Die meisten EUKLID DynaGeo - Zeichnungen werden sich aber wohl ohne gr&ouml;&szlig;ere Probleme im Geometria-Format exportieren lassen. Herr Ehmke stellt das Programm als Freeware zur Verf&uuml;gung. Weitere Details k&ouml;nnen auf seinen Seiten im Internet unter </P>

<P><B><UL><a href="http://www.geometria.de/">http://www.geometria.de/</a></UL></B> </P>

<P>nachlesen. Sie finden dort eine <B>ausf&uuml;hrliche Dokumentation</B> zu Geometria, einige <B>Anwendungsbeispiele</B> und einen Link zu den Web-Seiten des Instituts f&uuml;r Mathematik der Universit&auml;t Flensburg: dort gibt es eine <B>umfangreiche Galerie</B> interessanter geometrischer Fragestellungen, die mit Geometria veranschaulicht werden.</p>

<p>Ehe Sie mit EUKLID DynaGeo HTML-Seiten f&uuml;r Geometria herstellen, sollten Sie sicherstellen, dass eine JAVA-VM auf Ihrem Rechner installiert ist. Au&szlig;erdem sollten Sie sich die JAVA-Datei "geometria.jar" von der <a href="http://www.geometria.de/">Geometria-Homepage</a> herunterladen. Kopieren Sie diese dann in das Unterverzeichnis "Viewer" Ihres EUKLID DynaGeo - Verzeichnisses.</P>
<br>
<br>
</FONT>
</BODY>
</HTML>