<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Form &amp; Farbe-Leiste</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="toolbar">
        <PARAM NAME="Keyword" VALUE="attribute">
</OBJECT>

<A NAME="idh_cm_editdraw"></A>

<H2>Die Form &amp; Farbe-Leiste</H2>
<HR>

<p>Zum Ver&auml;ndern des &auml;u&szlig;eren Erscheinungsbildes der Objekte Ihrer Zeichnung stehen Ihnen hier die folgenden Befehle zur Verf&uuml;gung:</p>
<br>
<ul>
<img src="../IMAGES/ToolPinsel.gif" width="32" height="32" border="0" alt="">&nbsp;&nbsp;&nbsp;Schaltet den <b>Editiermodus</b> ein.<br>
<ul> Rechts neben diesem Knopf werden auf <b>vier Attribut-Symbolen</b> die aktuellen Werte f&uuml;r <i>Linienart</i>, <i>Punktform</i>, <i>F&uuml;llmuster</i> und <i>Farbe</i> angezeigt. Wenn Sie im Editiermodus ein Objekt Ihrer Zeichnung anklicken, dann bekommt es die dort <u>aktuell eingestellten</u> Attribut-Werte zugewiesen. Wenn Sie den Wert eines solches Attributs &auml;ndern wollen, klicken Sie auf das zugeh&ouml;rige Symbol; dann &ouml;ffnet sich ein Men&uuml; bzw. ein Fenster, in dem Sie den neuen Wert ausw&auml;hlen k&ouml;nnen. Die folgende Tabelle zeigt die verf&uuml;gbaren Attribut-Werte:<br>
<br>
<ul>
<table width="75%" border frame="void" cellspacing="0" cellpadding="10">
<tr>
 <th><font color="#0000FF">Attribute</font></th>
 <th><font color="#0000FF">M&ouml;gliche Werte</font></th>
</tr>
<tr>
 <td><b><i> Linienart </i></b></td>
 <td><IMG SRC="../images/toolb301.gif" ALT="" BORDER=0></td>
</tr>
<tr>
 <td><b><i> Punktform </i></b></td>
 <td><IMG SRC="../images/toolb302.gif" ALT="" BORDER=0></td>
</tr>
<tr>
 <td><b><i> F&uuml;llmuster </i></b></td>
 <td><IMG SRC="../images/toolb303.gif" ALT="" BORDER=0></td>
</tr>
<tr>
 <td><b><i> Farbe </i></b></td>
 <td>Beim Klicken &ouml;ffnet sich der Windows-Standard-Dialog zur Farb-Auswahl. Nach dem Schlie&szlig;en dieses Fensters zeigt das "Farbe"-Symbol die gew&auml;hlte Farbe an, z.B.:<br>
<IMG SRC="../images/toolb304.gif" ALT="" BORDER=0> (falls Sie "rot" gew&auml;hlt haben)</td>
</tr>
</table>
<br>
</ul>
Wenn Sie beim Bewegen der Maus die <I>ALT</I>-Taste gedr&uuml;ckt halten, verwandelt sich der Cursor in eine <B>Pipette</B>, mit der Sie umgekehrt die Attribute eines angeklickten Objekts als aktuelle Attribute in die Form &amp; Farbe-Leiste &uuml;bernehmen k&ouml;nnen.<br>
</ul>
<br>

<img src="../IMAGES/ToolKanne.gif" alt="" border="0">&nbsp;&nbsp;&nbsp;<b>Fl&auml;che ausf&uuml;llen</b><br>
<ul>
Nach einem Klick auf dieses Symbol k&ouml;nnen Sie (mit der Maus) den <b>Rand</b> der zu f&uuml;llenden Fl&auml;che anklicken; zul&auml;ssige Randkurven sind <b>Polygone</b> und <b>Kreise</b>. Danach wird die von der gew&auml;hlten Linie umschlossene Fl&auml;che ausgef&uuml;llt. (Es wird stets das Innere der Randkurve ausgef&uuml;llt.) F&uuml;llmuster und Farbe werden automatisch stets so gew&auml;hlt, dass eine m&ouml;glichst noch nicht in der Zeichnung vorkommende Kombination aus F&uuml;llmuster und Farbe verwendet wird.<br>
<br>
Sie k&ouml;nnen als Rand der zu f&uuml;llenden Fl&auml;che auch eine <b>Gerade</b> anklicken, um eine <b>Halbebene</b> zu f&uuml;llen. In diesem Fall m&uuml;ssen Sie aber zus&auml;tzlich in die von Ihnen gemeinte Halbebene klicken, damit klar wird, welche der beiden Halbebenen gef&uuml;llt werden soll.
</ul>
<br>

<img src="../IMAGES/ToolSchere.gif" alt="" border="0">&nbsp;&nbsp;&nbsp;<b>F&uuml;llung zuschneiden</b><br>
<ul>
Dieser Befehl gestattet es Ihnen, auch komplizierter berandete Figuren zu f&uuml;llen, indem Sie eine vorhandene F&uuml;llung l&auml;ngs einer Linie <b>abschneiden</b>; zul&auml;ssige Schnittlinien sind <b>Geraden</b> und <b>Kreise</b>.<br>
<br>
Klicken Sie zun&auml;chst die zu bearbeitende <b>F&uuml;llung</b> an, sodann die <b>Schnittlinie</b> und schlie&szlig;lich denjenigen <b>Teil der F&uuml;llung</b>, den Sie <u>behalten</u> wollen. Dann wird nur noch der von Ihnen gew&auml;hlte Teil der Fl&auml;che gef&uuml;llt erscheinen.
</ul>
<br>
</ul>
</FONT>
</BODY>
</HTML>