<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Men&uuml;konfiguration w&auml;hlen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Einstellungen">
        <PARAM NAME="Keyword" VALUE="Optionen">
        <PARAM NAME="Keyword" VALUE="Men&uuml;konfigurationen">
</OBJECT>

<A NAME="idh_opt_menu"></A>

<H2>Einstellungen | Men&uuml;konfiguration</H2>
<HR>

<P><B>L&auml;nge der Liste der zuletzt benutzten Dateien:</B><BR>
<ul>Im Datei-Men&uuml; wird normalerweise Liste der zuletzt bearbeiteten GEO-Dateien gezeigt. Im diesem Editierfeld k&ouml;nnen sie einstellen, wieviele solche Eintr&auml;ge maximal im Dateimen&uuml; angezeigt werden sollen. Wenn Sie sich f&uuml;r ”0” entscheiden, wird keine solche Liste angezeigt.<BR>
Bereich: [0 ........ (<b>4</b>) ....... 9]</ul><br>
</P>

<p>Wenn Sie EUKLID DynaGeo in einem Netz betreiben, dann sind die im folgenden beschriebenen Funktionen nur dann verf&uuml;gbar, wenn der Administrator Ihnen die entsprechenden Rechte zugestanden hat:</p>

<ul>
<li><p>Sie k&ouml;nnen auf dieser Registerkarte aus verschiedenen vorgefertigten <a href="JavaScript:HHCTRL.TextPopup(pop_menuconf,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!"><b>Men&uuml;konfigurationen</b></a> die f&uuml;r Ihre Zwecke passende heraussuchen. W&auml;hlen Sie aus der DropDown-Liste die gew&uuml;nschte Konfiguration aus, und schlie&szlig;en Sie das Fenster mit <i>Okay</i>. Dann werden alle Befehle deaktiviert, die in dieser Men&uuml;konfiguration nicht verf&uuml;gbar sein sollen.</p></li>
<li><p>Sollten Ihnen die mitgelieferten Konfigurationen nicht gen&uuml;gen, dann k&ouml;nnen Sie sich zus&auml;tzlich eigene <b>erstellen</b>. Klicken Sie dazu auf den Schalter  <i>Neu...</i>. </p></li>
<li><p>Mit dem Schalter <i>Editieren</i> k&ouml;nnen Sie die von Ihnen hinzugef&uuml;gten Men&uuml;konfigurationen nachtr&auml;glich <b>&auml;ndern</b>. Es wird diejenige Men&uuml;konfiguration editiert, die aktuell in der DropDown-Liste selektiert ist. Ist dies jedoch eine der voreingestellten ("globalen") Konfigurationen, dann ist der <i>Editieren</i>-Schalter deaktiviert.</p></li>
<li><p>Mit dem Schalter <i>L&ouml;schen</i>  k&ouml;nnen Sie die <u>letzte</u> Ihrer selbsterstellten Konfigurationen komplett <b>l&ouml;schen</b>. Der Schalter ist aber nur dann aktiviert, wenn in der DropDown-Liste der <u>letzte</u> Eintrag selektiert ist und dieser Eintrag nicht zu den voreingestellten ("globalen") Konfigurationen geh&ouml;rt.</p></li>
</ul>
<br>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="createmenukonf.htm">Eigene Men&uuml;konfigurationen erstellen</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>