<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Copyright-Vermerk editieren</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Datei">
        <PARAM NAME="Keyword" VALUE="Copyright">
        <PARAM NAME="Keyword" VALUE="Eigenschaften">
</OBJECT>

<A NAME="idh_cm_FileProp"></A>

<H2>Copyright-Vermerk editieren</H2>
<HR>
<br>
Dieser Men&uuml;punkt f&uuml;hrt zu einem Fenster, in dem Sie einen Copyright-Text f&uuml;r Ihre aktuelle Zeichnung eingeben bzw. bearbeiten k&ouml;nnen.<br>
<br>
<br>
<ol start="1" type="1">
<li>In einem <font color="#0000FF">ersten Feld <i>"Copyright-Vermerk"</i></font> k&ouml;nnen Sie als Besitzer einer EUKLID DynaGeo - Lizenz die von Ihnen erstellten Dateien mit einem <B>Copyright-Vermerk</B> versehen, den <B>nur Sie</B> wieder editieren k&ouml;nnen. Wenn Sie jedoch eine GEO-Datei laden, die unter einer anderen EUKLID DynaGeo - Lizenz erstellt wurde, dann ist dieses Copyright-Feld schreibgesch&uuml;tzt.<br>
<br>
<font color="#FF0000"><b><i>Achtung !</i></b></font>
<ul>Ihr Copyright-Vermerk ist <B>kein Schreibschutz</B> f&uuml;r den Datei-Inhalt! Jeder Nutzer kann <u>sein</u> Exemplar Ihrer Zeichnung beliebig weiterbearbeiten, Objekte editieren oder l&ouml;schen, andere hinzuf&uuml;gen... - lediglich Ihren Copyright-Vermerk kann er nicht ver&auml;ndern oder gar entfernen: auch die ver&auml;nderte Datei wird diesen Ihren Vermerk enthalten, selbst wenn sie unter einem anderen Namen abgespeichert wird.<br>
</ul>
<br>
<br>
</li>
<li>In einem <font color="#0000FF">zweiten Feld <i>"Aktuelle Datei-Attribute"</i></font> werden Ihnen der <b>Dateiname</b>, das <B>Erstellungsdatum</B> der Datei, das <b>Datum der letzten &Auml;nderung</b> sowie die <nobr><b>EUKLID DynaGeo - Version</b></nobr> angezeigt, mit der diese Datei zuletzt bearbeitet wurde. Dar&uuml;berhinaus wird die aktuelle <b>Dateigr&ouml;&szlig;e</b> angezeigt. Diese Daten k&ouml;nnen hier nicht ver&auml;ndert werden und dienen nur zu Ihrer Information.<br>
<br>
<br>
</li>
</ol>
<br>
<br>
<p>Wenn Sie das Fenster mit einem Klick auf den <i>"Okay"</i>-Knopf rechts oben schlie&szlig;en, werden Ihre &Auml;nderungen in die aktuelle Zeichnung geschrieben. Schlie&szlig;en Sie das Fenster dagegen mit dem <i>"Abbrechen"</i>-Knopf, werden Ihre &Auml;nderungen verworfen.</p>
</FONT>
</BODY>
</HTML>