<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Danksagungen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">

<A NAME="idh_thanks"></A>

<H2>Bedanken...</H2>
<HR>

<P>...m&ouml;chte ich mich vor allem bei <B>meiner Frau</B>, die das Projekt weiterhin mit konstruktiver Anteilnahme begleitet und mich in so mancher Erm&uuml;dungsphase neu motiviert.</P>

<P>Besonderen Dank schulde ich Herrn <B>Prof. Jean-Marie Laborde</B> von der Universit&auml;t Grenoble, der Ende der 80er Jahre mit seinem Programm "Cabri g&eacute;om&egrave;tre" die dynamische Computer-Geometrie in Europa begr&uuml;ndete. Ihm haben alle Autoren von Programmen zur "beweglichen Geometrie" viel zu verdanken, hat er doch mit seinem "Cabri" diese Programmgattung recht eigentlich definiert.</p>

<p> Sodann danke ich <B>Hans-J&uuml;rgen Elschenbroich</B> und <B>Thomas Gawlick</B> f&uuml;r ihre stets ermutigende Kritik und ihren hilfreichen Rat in vielen Fragen der Didaktik dynamischer Geometrie. Des weiteren geht mein herzlicher Dank an all die flei&szlig;igen Beta-Testern; allen voran m&ouml;chte ich hier <b>Herrn Klement, Herrn J&auml;ger und Herrn Viertel</b> erw&auml;hnen, die mit konstruktiver Hartn&auml;ckigkeit so manches Detailproblem einer L&ouml;sung zugef&uuml;hrt haben.</p>

<p><b>Prof. Ulrich Kortenkamp</b> m&ouml;chte ich f&uuml;r das mathematische Abenteuer danken, das mir die Lekt&uuml;re seiner Ver&ouml;ffentlichungen zu den Konstruktionsprinzipien von "Cinderella" bereitet hat. Ein spezieller Dank geht an ihn und <b>Prof. J&uuml;rgen Richter-Gebert</b> f&uuml;r die freundlicherweise zur Verf&uuml;gung gestellten Informationen &uuml;ber die Konstruktionsprinzipien ihres "probabilistischen Beweisers". Und schlie&szlig;lich m&ouml;chte ich mich auch herzlich bedanken bei <b>Markus Hohenwarter</b>, dem Autor von "GeoGebra": die Lekt&uuml;re seiner Diplomarbeit war f&uuml;r mich ein mathematischer Fortbildungskurs, der mich in den Stand setzte, einige schon seit vielen Jahren aufgeschobene Probleme einer L&ouml;sung zuzuf&uuml;hren.</P>

<P>Mein Dank gilt weiter all den Kollegen, bei denen ich das Programmierhandwerk erlernen durfte, z.B. <B>Bernd Ebbmeyer</B>, (zeigte, wie die B&auml;ume wachsen, wenn man richtig zeigert); <B>Klaus Heidler</B> (schob mich &uuml;ber die Schwelle zur objektorientierten Programmierung) und <B>Konrad Dammeier</B> (f&uuml;hrte mich sp&auml;ter bei den ersten Schritten in Delphi an der Hand). Ein herzliches Dankesch&ouml;n geht auch an <b>Michael Moosbauer</b>, der mir in einigen "kryptischen Fragen" wesentlich weitergeholfen hat, sowie an die Autoren von "UPX!", deren Tool die EXE zur exe macht, und schlie&szlig;lich an <b>Gustavo Daud</b> f&uuml;r seine PNG-Bibliothek. Vielen Dank auch an <b>Tom Schaller</b> f&uuml;r seine HTMLEdit-Komponente, die mir die Migration von RichText nach HTML erst erm&ouml;glicht hat.</p>

<P>Moderne Windows-Programmierung ist inzwischen kaum mehr ohne Unterst&uuml;tzung aus dem Internet zu bew&auml;ltigen, weshalb mein Dank schlie&szlig;lich all den auskunftsfreudigen Programmierkollegen aus aller Welt gilt, die ihr Wissen in den diversen Delphi-News-Groups oder auf eigenen Internetseiten zur Verf&uuml;gung stellen. Ohne die Hilfe von z.B. <B>Peter Bartholdsson</B>, <B>Conrad Herrmann</B>, <B>George Pestana</B>, <B>Hans Nievenhuis</B> und <b>Peter J. Haas</b> w&auml;re manches Programmierproblem wohl ungel&ouml;st geblieben. Ein spezieller Dank geht an Jordan Russell, dessen sch&ouml;nes Installationsprogramm ("InnoSetup", siehe <a href="http://www.innosetup.com/">http://www.innosetup.com/</a>) mir seit Jahren die Distribution erleichtert.</P>

<p>Und schlie&szlig;lich m&ouml;chte ich mich bei meinen flei&szlig;igen Sch&uuml;lern vom Grundkurs Informatik 2005/06 am Oken-Gymnasium bedanken: dem Engagement und der konstruktiven Arbeit von <b>Philipp Kern</b>, <b>Benjamin Herr</b>, <b>Sebastian Klaas</b>, <b>Alexander Schwende</b>, <b>Noel Weidenhammer</b>, <b>Christoph Borschensky</b>, <b>Sebastian Mayer</b> und <b>Armin Burgmeier</b> ist es zu verdanken, dass aus der vagen Idee "Java-Viewer f&uuml;r GEO-Dateien" das handgreifliche Projekt "DynaGeoJ" werden konnte. Ohne den Anschub durch meinen "<b>best GK Inf ever</b>" (Stand 2009!) h&auml;tte ich wohl kaum den Mut gefunden, die Aufgabe ernsthaft anzugehen.</p>

<br>
<br>
</FONT>
</BODY>
</HTML>