<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Affine Abbildung festlegen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Abbilden">
        <PARAM NAME="Keyword" VALUE="Abbildung">
        <PARAM NAME="Keyword" VALUE="Affin">
</OBJECT>

<A NAME="idh_cm_DefAffin"></A>

<H2>Affine Abbildung festlegen...&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/ToolDefAffin.gif" ALT="" BORDER=0></H2>
<HR>

<P>Wenn Sie diesen Befehl w&auml;hlen, startet ein <b>"Assistent"</b>, der Ihnen bei der <b>Definition einer konkreten affinen Abbildungen</b> helfen soll. Zur erfolgreichen Nutzung der Dienste dieses Assistenten muss allerdings ein wenig Sachverstand bez&uuml;glich des Themengebietes vorausgesetzt werden: Sie sollten wissen, was Sie tun.</P>

<p>
<ul>
<li>Im ersten Fenster des Assistenten w&auml;hlen Sie den <b>Typ der affinen Abbildung</b> aus, die Sie erstellen wollen. Zur Auswahl stehen die folgenden M&ouml;glichkeiten:<br>
<br>
<ul>
<li>Scherung</li>
<li>Orthogonale Streckung</li>
<li>Schr&auml;gspiegelung</li>
<li>Allgemeine axiale Affinit&auml;t</li>
<li>Euler'sche Affinit&auml;t</li>
<li>Affin-Drehung</li>
<li>Allgemeine Affinit&auml;t durch 3 Punkt-Bildpunkt-Paare</li>
<li>Allgemeine Affinit&auml;t durch 6 Koeffizienten (Matrix)</li>
</ul>
<br>
Die ersten 4 dieser Abbildungen sind die sogenannten <u>Achsen-Affinit&auml;ten</u>, also Affinit&auml;ten mit einer Fixpunktgeraden. Die n&auml;chsten beiden sind <u>Affinit&auml;ten mit genau einem Fixpunkt</u>. Die letzten beiden bieten Ihnen die M&ouml;glichkeit einer weitgehend freien Definition einer <u>allgemeinen Affinit&auml;t</u>, entweder "geometrisch" &uuml;ber ein Dreieck und sein Bild-Dreieck oder "algebraisch" &uuml;ber die Eingabe der Koeffizienten der Abbildungs-Matrix.<br>
<br>
</li>
<li>In den n&auml;chsten Fenstern werden je nach gew&auml;hltem Abbildungs-Typ die entsprechenden <b>definierenden Objekte</b> erfragt. Sie werden dabei Schritt f&uuml;r Schritt durch diesen Prozess geleitet. Schon in der Zeichnung vorhandene Objekte k&ouml;nnen dabei wie &uuml;blich durch Anklicken mit der Maus ausgew&auml;hlt werden. <br>
<br>
</li>
<li>Im abschlie&szlig;enden Fenster werden Sie &uuml;ber die <b>erfolgreiche Erstellung</b> Ihrer Abbildung informiert. Intern wird ein entsprechendes "Abbildungs-Objekt" erzeugt. Sie bemerken davon aber zun&auml;chst nicht viel mehr, als dass dem Untermen&uuml; "<i>Objekt abbilden mit...</i>" des "<i>Abbilden</i>"-Men&uuml;s ein <b>neuer Eintrag</b> hinzugef&uuml;gt wird, der die von Ihnen gerade definierte Abbildung als neuen Befehl zur Verf&uuml;gung stellt. <br>
<br>
<br>
</li>
</ul>
</p>

<p>Um die gerade eben definierte Abbildung nun auf ein Objekt anzuwenden, w&auml;hlen Sie aus dem Untermen&uuml; "<i>Objekt abbilden mit...</i>" des "<i>Abbilden</i>"-Men&uuml;s den entsprechenden Eintrag aus. Geben Sie dann das abzubildende Objekt an. Danach wird das Bildobjekt erzeugt und angezeigt.</p>

<p>Das Untermenu "<i>Objekt abbilden mit...</i>" l&auml;sst sich auch direkt &uuml;ber den ganz rechts stehenden Knopf "<i>Objekt abbilden mit...</i>" auf der Werkzeugleiste "<i>Abbilden</i>" erreichen: ein Klick auf diesen Knopf zeigt hier eine Kopie dieses Untermen&uuml;s an.</p>
<br>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="objabb.htm">Objekt abbilden mit...</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>