<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Konstruktionsbefehle in DynaGeoX</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Export">
        <PARAM NAME="Keyword" VALUE="DynaGeoX">
        <PARAM NAME="Keyword" VALUE="HTML">
        <PARAM NAME="Keyword" VALUE="ActiveX">
</OBJECT>

<A NAME="idh_dgxj_cmds"></A>

<H2>Konstruktionsbefehle in DynaGeoX und DynaGeoJ</H2>
<HR>

<P>Neben der reinen Darstellung einer dynamischen Zeichnung erlauben die Viewer DynaGeoX und DynaGeoJ auch in eingeschr&auml;nktem Ma&szlig;e das <b>Konstruieren neuer Objekte</b>. Sie entscheiden selbst, welche Konstruktionsbefehle Sie dem Besucher Ihrer HTML-Seiten zur Verf&uuml;gung stellen wollen, und zwar beim Export Ihrer Zeichnung aus EUKLID DynaGeo: klicken Sie dazu im Fenster "Zeichnung in DynaGeoX-HTML-Seite speichern" auf den Knopf "Viewer-Befehle". Dann erscheint ein "Viewer-Befehle ausw&auml;hlen"-Fenster. Es enth&auml;lt eine Liste von m&ouml;glichen Konstruktionsbefehlen f&uuml;r den Viewer. W&auml;hlen Sie diejenigen aus, die zur Bearbeitung Ihrer Zeichnung ben&ouml;tigt werden. Zur Laufzeit des Viewers wird dann am linken Rand des Viewer-Fensters eine senkrechte <b>Werkzeugleiste</b> erscheinen, die f&uuml;r jeden der gew&auml;hlten Befehle einen entsprechenden Knopf enth&auml;lt.</P>

<p>Sie k&ouml;nnen insgesamt <b>h&ouml;chstens 12 Befehle</b> f&uuml;r den Eintrag in die Werkzeugleiste des Viewers ausw&auml;hlen. Wenn die Anzahl der ausgew&auml;hlten  Befehle den maximalen Wert erreicht hat, dann werden die &uuml;brigen Eintr&auml;ge der Befehlsliste grau dargestellt, und es kann kein zus&auml;tzlicher Befehl mehr hinzugew&auml;hlt werden. Erst wenn Sie einen der bisher schon gew&auml;hlten Befehle wieder abw&auml;hlen, werden die &uuml;brigen Listeneintr&auml;ge wieder aktiviert.</p>
<br>

<P>Zus&auml;tzlich bieten die Viewer zur Laufzeit <b>Kontextmen&uuml;s</b> an, in denen weitere Befehle bereitgestellt werden, und zwar sowohl f&uuml;r die gesamte Zeichnung als auch f&uuml;r jedes einzelne Objekt:
<ul>
<li>Mit einem Rechtsklick auf eine leere Stelle der Zeichnung rufen Sie das <b>Kontextmen&uuml; der Zeichnung</b> auf. Es enth&auml;lt Befehle, die Ihnen (unter anderem) erlauben, die Zeichnung zu <b>vergr&ouml;&szlig;ern</b>, zu <b>verkleinern</b>, sie in den Originalzustand <b>zur&uuml;ckzusetzen</b> und die aktuelle Zeichnung <b>in einer Datei abzuspeichern</b>. Au&szlig;erdem wird ein Befehl zum <b>L&ouml;schen</b> einzelner Objekte bereitgestellt.<br>
<br>
<ul><font size="-1">Seien Sie aber etwas vorsichtig beim L&ouml;schen von Objekten: im Viewer gibt es keine M&ouml;glichkeit, ein gel&ouml;schtes Objekt zu reanimieren! Diesen Komfort bietet nur das originale EUKLID DynaGeo-Programm.</font></ul>
<br></li>
<li>Mit einem Rechtsklick auf ein Objekt ihrer Zeichnung rufen Sie das <b>Kontextmen&uuml; dieses Objekts</b> auf. Welche Eintr&auml;ge es tats&auml;chlich enthalten wird, h&auml;ngt vom Typ des jeweiligen Objekts ab. So l&auml;sst sich z.B. &uuml;ber das Kontextmen&uuml; eines Punktes eine <b>Punktbindung</b> herstellen und auch wieder l&ouml;sen. Aber auch <b>Darstellungsattribute</b> von Punkten, Linien und Fl&auml;chen k&ouml;nnen &uuml;ber deren Kontextmen&uuml;s ge&auml;ndert werden.<br>
<br>
<ul><font size="-1">Obwohl das Kontextmen&uuml; eines Objekts auch den Eintrag <b>"Verbergen"</b> enth&auml;lt, sollten Sie mit diesem Befehl ebenfalls vorsichtig sein: ein <u>einzelnes</u> Objekt l&auml;sst sich nicht gezielt wieder sichtbar machen, weil man eben das Kontextmen&uuml; eines unsichtbaren Objekts nicht aufklappen kann! Im Notfall k&ouml;nnen Sie aus dem Kontextmen&uuml; <u>der Zeichnung</u> den Befehl "Alle verborgenen Objekte anzeigen" anwenden, aber dadurch werden eben <u>alle</u> verborgenen Objekte wieder sichtbar geschaltet.</font></ul><br>
<br></li>
</ul></p>

<p>Die Konstruktionsbefehle der Werkzeugleiste erweitern die didaktische Reichweite der Viewer ganz betr&auml;chtlich. Die Viewer sind jedoch definitiv nur f&uuml;r die <b>Bearbeitung</b> von geometrischen Arbeitsbl&auml;ttern durch Sch&uuml;ler gedacht, nicht aber f&uuml;r deren <b>Erstellung</b> durch den Lehrer. Damit die Viewer einfach zu handhaben bleiben, wird ihr Funktionsumfang stets deutlich geringer bleiben als der des originalen EUKLID DynaGeo-Programms. Wer also im Viewer irgend welche Features vermisst, die er zur Erstellung umfangreicher oder raffinierter Zeichnungen ben&ouml;tigt, der sollte EUKLID DynaGeo benutzen!</p>

<br>
<br>
</FONT>
</BODY>
</HTML>