<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Drucker-Optionen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Datei">
        <PARAM NAME="Keyword" VALUE="Drucken">
</OBJECT>

<A NAME="idh_cm_PrnInit"></A>

<H2>Drucker-Optionen...</H2>
<HR>

<P>Dieser Dialog erlaubt Ihnen, die Druckausgabe von EUKLID DynaGeo zu konfigurieren:<br>
<br></P>

<p>In der Auswahlbox <b>Ausgabe-Format</b> legen Sie den Ausgabebereich f&uuml;r den Ausdruck fest. Es stehen Ihnen drei M&ouml;glichkeiten zur Verf&uuml;gung:<br>
<ul>
<li>Hochformat, obere halbe Seite</li>
<li>Hochformat, ganze Seite</li>
<li>Querformat, ganze Seite</li>
</ul>
Die Standard-Einstellung ist "Hochformat, obere halbe Seite".<br>
<br>
<br>
</p>

<P>Im Bereich <b>"Ausgabe-Fenster"</b> legen Sie fest, wie die Zeichnung im Ausgabebereich positioniert werden soll:
<ul>
<li><P>Das Eingabefeld <B>Skalierungsfaktor</B> enth&auml;lt den aktuellen Faktor, mit dem ein (logischer Bildschirm-) Zentimeter vor dem Ausdruck multipliziert wird. Ist der Skalierungsfaktor z.B. 0.666, dann wird eine auf dem Bildschirm als 10 cm lang ausgewiesene Strecke im Ausdruck 6.66 cm lang dargestellt. Enth&auml;lt die Zeichnung jedoch Bema&szlig;ungen, dann werden diese Ma&szlig;e nicht umgerechnet; Sie erhalten also nur bei einem Skalierungsfaktor von 1,000 eine 1:1-Abbildung.</P> </li>
<li><P>Das Eingabefeld <B>Rel. Randbreite</B> enth&auml;lt die relative Breite des Randes in Prozenten der Abmessungen des aktuellen Druckbereiches. Bei Querformat-Ausdrucken ist der Druckbereich das gesamte Blatt, bei Hochformat-Ausdrucken nur die obere H&auml;lfte des Blattes. Ist die relative Randbreite z.B. 5, dann werden f&uuml;r den Ausdruck nur (100 - 2*5)% = 90% der Breite bzw. H&ouml;he des Druckbereiches genutzt.</P> </li>
</ul>
<br>
</P>

<P>Im Bereich <b>"Aktiver Drucker"</b> wird Ihnen der aktuell in Windows gew&auml;hlte Drucker angezeigt.<br>
&Uuml;ber die Schaltfl&auml;che <B>"Drucker einrichten"</B> kommen Sie zu einer Dialogbox, in der Sie druckerspezifische Voreinstellungen f&uuml;r den Ausdruck vornehmen k&ouml;nnen. Wie diese Dialogbox aussieht, h&auml;ngt vom jeweils verwendeten Drucker ab. Es k&ouml;nnen hier solche Dinge wie Papierformat, Orientierung (Hoch- oder Querformat) und Druckqualit&auml;t (Aufl&ouml;sung) eingestellt werden.<br>
<br>
<br>
</P>

<p>Auf der rechten Seite dieses Dialogs finden Sie <b>vier Schaltfl&auml;chen</b>:<br>
<ul>
<li><b>"Vorschau..."</b> ruft ein Fenster auf, in dem Ihnen eine Druckbild-Vorschau gezeigt wird.<br>
<br></li>
<li><b>"Drucken"</b> schlie&szlig;t das Fenster, &uuml;bernimmt die von Ihnen eingegebenen Einstellungen und startet einen Ausdruck Ihrer aktuellen Zeichnung.<br>
<br></li>
<li><b>"Schlie&szlig;en"</b> schlie&szlig;t das Fenster und &uuml;bernimmt die von Ihnen eingegebenen Einstellungen.<br>
<br></li>
<li><b>"Abbrechen"</b> schlie&szlig;t das Fenster, ohne Ihre &Auml;nderungen zu &uuml;bernehmen. Die Drucker-Einstellungen werden auf diejenigen Werte zur&uuml;ckgesetzt, die sie <u>vor</u> dem Aufruf dieses Dialogs hatten.</li>
</ul><br>
<br></p>

<P><B><I>Siehe auch:</I></B>
<ul>
<a href="optexport.htm">Einstellungen zum Daten-Export</a><br>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>