<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Objektdarstellung &auml;ndern</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Werkzeugleiste">
        <PARAM NAME="Keyword" VALUE="Attribute">
</OBJECT>

<A NAME="idh_cm_EditDraw"></A>

<H2>Darstellung von Punkten und Linien &auml;ndern&nbsp;&nbsp;&nbsp;<img src="../IMAGES/ToolPinsel.gif" width="32" height="32" border="0" alt=""></H2>
<HR>
<br>
Dieser Befehl erlaubt Ihnen, das &auml;u&szlig;ere Erscheinungsbild der Zeichnung zu editieren. Ein Klick auf den Knopf schaltet in den "Editiermodus" f&uuml;r alle punkt- bzw. linienarteigen Objekte Ihrer Zeichnung. Dazu geh&ouml;ren auch Ma&szlig;objekte, Zahl- und Termobjekte, Namensobjekte und Textboxen, kurz: alle Objekte der Zeichnung au&szlig;er den Fl&auml;chenf&uuml;llungen. F&uuml;r diese steht ein eigener Editierbefehl (<a href="fillarea.htm">Fl&auml;che f&uuml;llen</a>) zur Verf&uuml;gung.<br>
<br>
Rechts neben dem Befehlsknopf werden auf <b>drei Attribut-Symbolen</b> die aktuellen Werte f&uuml;r <i>Objekt-Farbe</i> <i>Punktform</i> und <i>Linienart</i> angezeigt. Wenn Sie im Editiermodus ein Objekt Ihrer Zeichnung anklicken, dann bekommt es die dort <u>aktuell eingestellten</u> Attribut-Werte zugewiesen. Wenn Sie den Wert eines solches Attributs &auml;ndern wollen, klicken Sie auf das zugeh&ouml;rige Symbol; dann &ouml;ffnet sich ein Men&uuml; bzw. ein Fenster, in dem Sie den neuen Wert ausw&auml;hlen k&ouml;nnen. Die folgende Tabelle zeigt die verf&uuml;gbaren Attribut-Werte:<br>
<br>
<ul>
<table width="75%" border frame="void" cellspacing="0" cellpadding="10">
<tr>
 <th><font color="#0000FF">Attribute</font></th>
 <th><font color="#0000FF">M&ouml;gliche Werte</font></th>
</tr>
<tr>
 <td><b><i> Farbe </i></b></td>
 <td>Beim Klicken &ouml;ffnet sich der Windows-Standard-Dialog zur Farb-Auswahl. Nach dem Schlie&szlig;en dieses Fensters zeigt das "Farbe"-Symbol die gew&auml;hlte Farbe an, z.B.:<br>
<IMG SRC="../images/toolb304.gif" ALT="" BORDER=0> (falls Sie "rot" gew&auml;hlt haben)</td>
</tr>
 <td><b><i> Punktform </i></b></td>
 <td><IMG SRC="../images/toolb302.gif" ALT="" BORDER=0></td>
</tr>
<tr>
 <td><b><i> Linienart </i></b></td>
 <td><IMG SRC="../images/toolb301.gif" ALT="" BORDER=0></td>
</tr>
</table>
<br>
</ul>
<br>
Wenn Sie beim Bewegen der Maus die <I>ALT</I>-Taste gedr&uuml;ckt halten, verwandelt sich der Cursor in eine <B>Pipette</B>, mit der Sie umgekehrt die Attribute eines angeklickten Objekts als aktuelle Attribute in die <i>Form &amp; Farbe</i>-Leiste &uuml;bernehmen k&ouml;nnen.<br>
<br>
Der Editiermodus bleibt so lange aktiv, bis Sie ihn abbrechen, z.B. indem Sie die ESC-Taste dr&uuml;cken, zu einer anderen Werkzeugleiste wechseln oder (&uuml;ber das Hauptmen&uuml;) einen anderen Befehl aktivieren.<br>
<br>
<br>
<br>
<b>Sonderfall der "Transparenten Punkte":  </b><br>
<ul>Wenn Sie einen <b>Punkt</b> "wei&szlig;" einf&auml;rben, dann wird er <b>transparent</b> dargestellt. Er wird also <u>&uuml;berhaupt nicht mehr sichtbar</u> sein, selbst wenn er vor einer farbigen Fl&auml;che liegt. Nur die Maus kann solch einen transparenten Punkte noch "sehen", sofern es sich um einen Basispunkt handelt.<br>
<br>
Transparente Punkte sind jedoch nur in <u>sehr speziellen</u> Situationen sinnvoll; seien Sie daher zur&uuml;ckhaltend bei der Verwendung der Farbe "wei&szlig;". Wenn Sie ein Objekt Ihrer Zeichnung nicht mehr angezeigt haben wollen, ist es normalerweise besser, es einfach zu <a href="OBJHIDE.HTM">verbergen</a>.<br>
</ul><br>
<br>
<br>
</ul>
</FONT>
</BODY>
</HTML>