<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Abbildungsmatrix editieren... </TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Abbilden">
        <PARAM NAME="Keyword" VALUE="Abbildung">
</OBJECT>

<A NAME="idh_cm_EditMap"></A>

<H2>Abbildungsmatrix anschauen / editieren... </H2>
<HR>

<p>Wenn Sie diesen Men&uuml;befehl aufrufen, erscheint ein Untermen&uuml;, das eine Liste aller bisher in der Zeichnung definierten affinen Abbildungen enth&auml;lt. W&auml;hlen Sie die <b>gew&uuml;nschte Abbildung</b> aus. Dann erscheint ein Fenster, in dem die Abbildungsvorschrift in vektorieller Form dargestellt wird.</P>

<p>Wenn die gew&auml;hlte Abbildung eine affine Abbildung ist, die durch eine Matrix mit vom Benutzer eingegebenen Koeffizienten festgelegt wurde, dann k&ouml;nnen Sie in diesem Fenster die Koeffizienten der Abbildungsmatrix <b>editieren</b>. In allen anderen F&auml;llen k&ouml;nnen Sie die Koeffizienten nur <b>anschauen</b>: wenn Sie z.B. eine Achsenspiegelung an einer Geraden g definiert haben, sind die Koeffizienten der Abbildungsmatrix durch die Lage dieser Geraden festgelegt, und eine direkte &Auml;nderung der Abbildungsmatrix ist nicht sinnvoll.</p>
<br>
<p>
<b><i>Bitte beachten Sie:   </i></b>
<ul>
<li>Enth&auml;lt die Zeichnung noch keine Abbildungen (z.B. bei einer leeren Zeichnung), dann ist dieser Befehl nicht verf&uuml;gbar: der entsprechende Men&uuml;punkt im Men&uuml; "<i>Abbilden</i>" ist deaktiviert und erscheint grau.<br>
<br>
</li>
<li>Die Liste der verf&uuml;gbaren Abbildungen enth&auml;lt nicht nur diejenigen Abbildungen, die &uuml;ber den Befehl "<i>Affine Abbildungen festlegen...</i>" definiert wurden, sondern auch alle anderen Abbildungen, die in dieser Zeichnung schon ausgef&uuml;hrt worden sind. Lediglich Kreisspiegelungen werden hier nicht aufgef&uuml;hrt, weil deren Abbildungsvorschrift sich nicht durch eine Matrix darstellen l&auml;sst. <br>
<br>
</li>
</ul>
</p>
<br>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="defaffin.htm">Affine Abbildung festlegen...</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>