<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>
<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>
<TITLE>Fl&auml;che f&uuml;llen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Werkzeugleiste">
        <PARAM NAME="Keyword" VALUE="Attribute">
</OBJECT>

<A NAME="idh_cm_FillArea"></A>

<H2>Fl&auml;che f&uuml;llen&nbsp;&nbsp;&nbsp;<img src="../IMAGES/ToolKanne.gif" width="32" height="32" border="0" alt=""></H2>

<HR>

<P><font size="-1">(<a HREF="JavaScript:HHCTRL.TextPopup(pop_autorepeat,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">automatisch wiederholbar</a>)</font></P>

<P>Mit diesem Befehl k&ouml;nnen Sie ein <b>Polygon</b> oder einen <b>Kreis</b> bzw. eine <b>Ellipse</b> mit einem F&uuml;llmuster ausf&uuml;llen. Klicken Sie dazu (mit der Maus) den <b>Rand</b> der zu f&uuml;llenden Fl&auml;che an. Danach wird die von der gew&auml;hlten Linie umschlossene Fl&auml;che ausgef&uuml;llt. Es wird stets das Innere der Randkurve ausgef&uuml;llt.</P>

<P>Sie k&ouml;nnen als Rand der zu f&uuml;llenden Fl&auml;che auch eine <b>Gerade</b> anklicken, um eine <b>Halbebene</b> zu f&uuml;llen. In diesem Fall m&uuml;ssen Sie aber zus&auml;tzlich in die von Ihnen gemeinte Halbebene klicken, damit klar wird, welche der beiden Halbebenen gef&uuml;llt werden soll.
</P>

<p>Rechts neben dem Befehlsknopf werden auf <b>zwei Attribut-Symbolen</b> die aktuellen Werte f&uuml;r <i>Farbe</i> und <i>F&uuml;llmuster</i>  angezeigt. Wenn Sie im Editiermodus ein Objekt Ihrer Zeichnung anklicken, dann bekommt es die dort <u>aktuell eingestellten</u> Attribut-Werte zugewiesen. Wenn Sie den Wert eines solches Attributs &auml;ndern wollen, klicken Sie auf das zugeh&ouml;rige Symbol; dann &ouml;ffnet sich ein Men&uuml; bzw. ein Fenster, in dem Sie den neuen Wert ausw&auml;hlen k&ouml;nnen. Die folgende Tabelle zeigt die verf&uuml;gbaren Attribut-Werte:<br>
<br>

<ul>
<table width="75%" border frame="void" cellspacing="0" cellpadding="10">
<tr>
 <th><font color="#0000FF">Attribute</font></th>
 <th><font color="#0000FF">M&ouml;gliche Werte</font></th>
</tr>
<tr>
 <td><b><i> Farbe </i></b></td>
 <td>Beim Klicken &ouml;ffnet sich der Windows-Standard-Dialog zur Farb-Auswahl. Nach dem Schlie&szlig;en dieses Fensters zeigt das "Farbe"-Symbol die gew&auml;hlte Farbe an, z.B.:<br>
<IMG SRC="../images/toolb304.gif" ALT="" BORDER=0> (falls Sie "rot" gew&auml;hlt haben)</td>
</tr>
<tr>
 <td><b><i> F&uuml;llmuster </i></b></td>
 <td><IMG SRC="../images/toolb303.gif" ALT="" BORDER=0></td>
</tr>
</table>
<br>
</ul>
</p>

<p>Wenn Sie beim Bewegen der Maus die <I>ALT</I>-Taste gedr&uuml;ckt halten, verwandelt sich der Cursor in eine <B>Pipette</B>, mit der Sie umgekehrt die Attribute eines angeklickten Objekts als aktuelle Attribute in die <nobr><i>Form &amp; Farbe</i>-Leiste</nobr> &uuml;bernehmen k&ouml;nnen.</p>

<p>Enth&auml;lt Ihre Zeichnung noch ungef&uuml;llte Polygone oder Kreise, dann werden beim Umschalten auf die <nobr><i>Form &amp; Farbe</i>-Leiste</nobr> F&uuml;llmuster und Farbe <b>automatisch</b> so eingestellt, dass eine m&ouml;glichst noch nicht in der Zeichnung vorkommende Kombination aus F&uuml;llmuster und Farbe verwendet wird. Dabei werden gestrichelte F&uuml;llungen bevorzugt. Auch nach jeder Ausf&uuml;ll-Aktion werden neue, noch nicht verwendete F&uuml;llattribute gesetzt, solange es noch ungef&uuml;llte Polygone bzw. Kreise in Ihrer Zeichnung gibt.</p>
<br>

</FONT>
</BODY>
</HTML>