<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>DynaGeo Grundlagen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">

<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Grundlagen">
        <PARAM NAME="Keyword" VALUE="Objekte">
</OBJECT>

<A NAME="idh_cm_HelpBasics"></A>

<H2>Was ist EUKLID DynaGeo?</H2>
<HR>

<P>EUKLID DynaGeo ist ein Geometrie-Zeichenprogramm, das <B>dynamische Zeichnungen</B> erstellt. Sie w&auml;hlen mit Hilfe der angebotenen Men&uuml;befehle oder durch Anklicken des entsprechenden Symbols der Werkzeugleiste, welches geometrische Objekt Sie erstellen wollen,und geben dann die Daten f&uuml;r dieses Objekt ein. EUKLID DynaGeo zeichnet das Objekt auf den Bildschirm.</P>

<P>Haben Sie mehrere Objekte erzeugt, dann k&ouml;nnen Sie die Zeichnung ver&auml;ndern, indem Sie ein <A HREF="JavaScript:HHCTRL.TextPopup(pop_baseobj, popfont, 10, 10, -1, -1)" Title="Klicken Sie, um eine Definition zu sehen!">Basisobjekt</A> mit der Maus <A HREF="JavaScript:HHCTRL.TextPopup(pop_drag,popfont,10,10,-1,-1)" Title="Klicken Sie, um eine Definition zu sehen!">verziehen</A>. Dabei wird die Lage aller von diesem Basisobjekt abh&auml;ngigen Objekte <B>automatisch aktualisiert</B>: die Zeichnung auf dem Bildschirm sieht stets so aus, als h&auml;tten Sie sie von vorneherein mit dem Basisobjekt in der neuen Lage erzeugt.</P>

<P>EUKLID DynaGeo verf&uuml;gt &uuml;ber eine leistungsf&auml;hige <B>kontextsensitive Hilfefunktion</B>: wenn Sie nicht mehr weiterwissen, dr&uuml;cken Sie die <i>F1</i>-Taste, wo auch immer Sie im Programm sind. EUKLID DynaGeo zeigt Ihnen dann eine Hilfe zur jeweils aktuellen Situation an.</P>

<P>EUKLID DynaGeo - Zeichnungen lassen sich <B>abspeichern </B>und wieder <B>laden</B>, &uuml;ber die Zwischenablage <B>exportieren</B> und nat&uuml;rlich auch <B>ausdrucken</B>. Das zum Speichern verwendete Dateiformat ist ein XML-basiertes Textformat; die Dateien tragen die Standard-Endung <I>GEO</I>.</P>

<P>Sie k&ouml;nnen Abst&auml;nde zwischen beliebigen Objekten sowie Winkelgr&ouml;&szlig;en <B>messen</B> und die jeweils aktuellen Werte in der Zeichnung anzeigen lassen. Dar&uuml;berhinaus k&ouml;nnen Sie <a href="termsyntax.htm">Terme</a> definieren, in denen diese Ma&szlig;e als Variablen verwendet werden; die Werte dieser Terme werden dann ebenfalls beim <A HREF="JavaScript:HHCTRL.TextPopup(pop_drag,popfont,10,10,-1,-1)" Title="Klicken Sie, um eine Definition zu sehen!">Verziehen</A> angezeigt und laufend aktualisiert.</P>

<P>Sie k&ouml;nnen Folgen von Konstruktionsschritten, die mehrfach auf die gleiche Art durchgef&uuml;hrt werden sollen, als <B>Makros</B> aufzeichnen. Damit k&ouml;nnen Sie selbst die F&auml;higkeiten von EUKLID DynaGeo erweitern. Makros k&ouml;nnen auch abgespeichert und wieder geladen werden. Die jeweils aktiven Makrobefehle erscheinen automatisch als zus&auml;tzliche Men&uuml;punkte im Makro-Men&uuml; des Hauptfensters.</P>

<p>Sie k&ouml;nnen die Bahn eines beliebigen Punktes Ihrer Konstruktion verfolgen, w&auml;hrend Sie Ihre Zeichnung durch Verziehen kontrolliert ver&auml;ndern. Solche Bahnen k&ouml;nnen als <b>Ortslinien</b> aufgezeichnet werden, die sich dann bei weiteren Zugvorg&auml;ngen automatisch aktualisieren. Dar&uuml;berhinaus verf&uuml;gt DynaGeo inzwischen &uuml;ber die F&auml;higkeit, die <b>Einh&uuml;llende</b> einer bewegten Geraden aufzuzeichnen.</p>

<P>Nachdem Sie eine Konstruktion durchgef&uuml;hrt haben, k&ouml;nnen Sie sie mit der <B>R&uuml;ckblende</B> nochmals auf dem Bildschirm ablaufen lassen. Wenn Sie es lieber schriftlich haben wollen, k&ouml;nnen Sie sich auch eine <B>Konstruktionsbeschreibung</B> anzeigen lassen. Und falls Ihre Zeichnung f&uuml;r andere Benutzer als Arbeitsvorlage dienen soll, k&ouml;nnen Sie Ihre Regieanweisungen oder Aufgabenstellungen in einer <B>Textbox</B>  &uuml;bermitteln.</P>

<P>Jede EUKLID DynaGeo - Zeichnung enth&auml;lt ein kartesisches <B>Koordinatensystem</B> mit L&auml;ngeneinheit 1 cm. Dies gestattet Ihnen, Punkte mit bestimmten Koordinaten zu erzeugen. Wenn Sie lieber koordinatenfrei arbeiten wollen, kann das Koordinatensystem verborgen werden.</P>

<P>EUKLID DynaGeo stellt Ihnen eine Vielzahl von <B>Zeichen-</B> und <B>Konstruktionsbefehlen</B> zur Verf&uuml;gung. Sie k&ouml;nnen jedoch den Befehlsvorrat auch einschr&auml;nken, indem Sie eine vom Standard abweichende <B>Men&uuml;konfiguration</B> w&auml;hlen. So kann z.B. ein Lehrer seine Sch&uuml;ler zwingen, die Mittelsenkrechten-Konstruktion statt mit dem entsprechenden Mittelsenkrechten-Befehl nun mit den elementaren Grundkonstruktionen (d.h. ”mit Zirkel und Lineal”) durchzuf&uuml;hren.</P>

Zum Studium von <b>Abbildungen</b> sind alle <b>Kongruenzabbildungen</b> (Achsenspiegelung, Punktspiegelung, Drehung und Verschiebung), die <b>zentrische Streckung</b> und ein komplettes Set der <b>Affinen Abbildungen</b> implementiert. Als Beispiel f&uuml;r eine nicht geradentreue Abbildung wird die <b>Kreisspiegelung</b> zur Verf&uuml;gung gestellt.

<p>Mit EUKLID DynaGeo k&ouml;nnen Sie auch Themen bearbeiten, die &uuml;ber die "reine" Geometrie hinausgehen. So sind neben den <b>Kegelschnittkurven</b> auch allgemeine <b>Funktionsschaubilder</b> verf&uuml;gbar. Sowohl <b>Tangenten</b> als auch <b>Integralfl&auml;chen</b> k&ouml;nnen dargestellt und gemessen werden.</p>

<P>Eine EUKLID DynaGeo - Zeichnung kann theoretisch aus so vielen Objekten bestehen, wie Sie im Speicher Ihres Computers unterbringen. Bei Zeichnungen mit vielen Objekten kann jedoch das <A HREF="JavaScript:HHCTRL.TextPopup(pop_drag,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Verziehen</A> eine etwas m&uuml;hsame Angelegenheit werden: die notwendigen Berechnungen und (vor allem) die graphischen Ausgaben erfordern f&uuml;r z&uuml;giges Arbeiten einen flotten Rechner und eine leistungsf&auml;hige Grafikkarte. </P>
<br>
<br>
</FONT>
</BODY>
</HTML>