<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Inhalt</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL"  SIZE=2>

<A NAME="idh_contents"></A>

<H2>Inhaltsverzeichnis</H2>
<HR>
<br>
<ul>
<H3><a href="newbies.htm">Einf&uuml;hrung</a></H3>
<ul>Was kann EUKLID DynaGeo f&uuml;r Sie tun?</ul>
<br>
<H3><a href="menues.htm">Die Men&uuml;-Befehle</a></H3>
<ul><p>Hier finden Sie eine vollst&auml;ndige Liste aller Kommandos und Befehle, die EUKLID DynaGeo kennt. Die Anordnung der Befehlsbeschreibungen folgt der Struktur des Hauptmen&uuml;s.</p></ul>
<br>
<H3><a href="toolbar.htm">Die Werkzeugleisten</a></H3>
<ul><p>Hier finden Sie Erkl&auml;rungen zur Funktion aller Befehlskn&ouml;pfe der Werkzeugleisten. Da nicht alle Befehle auch &uuml;ber die Werkzeugleisten zug&auml;nglich sind, enth&auml;lt dieser Abschnitt zu manchen Befehlen keine Informationen. In diesem Fall benutzen Sie bitte die Such-Funktion oder durchst&ouml;bern Sie selbst den Abschnitt <a href="menues.htm">Die Men&uuml;-Befehle</a>.</p></ul>
<br>
<H3><a href="lookinside.htm">Ein paar Blicke hinter die Kulissen</a></H3>
<ul><p>In diesem Abschnitt werden einige programm-interne Details dargestellt. Zwar sind diese Informationen f&uuml;r die meisten Anf&auml;nger zun&auml;chst nicht wichtig; f&uuml;r den fortgeschrittenen Benutzer stellen sie jedoch eine wertvolle Verst&auml;ndnishilfe dar - gerade im Krisenfall!</p></ul>
<br>
<H3><a href="reports.htm">Berichte aus der Programmier-Werkstatt</a></H3>
<ul><p>Hier finden Sie einige kleine Aufs&auml;tze zu grunds&auml;tzlicheren Problemen. Es werden fundamentale Ideen und Konzepte der (dynamischen) Geometrie vorgestellt und die in DynaGeo gew&auml;hlte Umsetzung beschrieben.</p></ul>
<br>
<H3><a href="problems.htm">Hilfe bei Problemen</a></H3>
<ul><p>Obwohl EUKLID DynaGeo durchaus zu den gutm&uuml;tigeren Windows-Programmen geh&ouml;rt, gibt es doch gelegentlich auf einzelnen Rechner das eine oder andere Problem. Hier werden einige schon h&auml;ufiger aufgetauchte Schwierigkeiten genannt und L&ouml;sungswege aufgezeigt.</p></ul>
<br>
<H3><a href="insthints.htm">Installation</a></H3>
<ul><p>Hier finden Sie technische Hilfe zur Installation des Programms (auch in Netzwerken!) und zur Lizenzierung.</p></ul>
<br>
<H3><a href="lizbed.htm">Lizenzbedingungen und Haftungsausschlu&szlig;</a></H3>
<H3><a href="impressum.htm">Kontakt</a></H3>
<H3><a href="danke.htm">Danke...</a></H3>
<br>
</ul>
</FONT>
</BODY>
</HTML>