<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Koordinatensystem</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Koordinatensystem">
</OBJECT>

<A NAME="idh_cm_CoordSys"></A>

<H2>Koordinatensystem&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/toolb401.gif" ALT="" BORDER=0></H2>
<HR>

<P>Dieser Befehl ruft ein Dialogfenster auf, das Ihnen verschiedene Darstellungsm&ouml;glichkeiten f&uuml;r das <B>Koordinatensystem</B> anbietet:</P>
In einem Teilfenster "Form" k&ouml;nnen Sie &uuml;ber das &auml;u&szlig;ere Erscheinungsbild der Koordinatensystems entscheiden:
<ul>
<li>Sie k&ouml;nnen zun&auml;chst w&auml;hlen, ob der Ursprung <b>sichtbar</b> oder verborgen sein soll.<br>
<br>
</li>
<li>Wenn Sie sich f&uuml;r einen sichtbaren Ursprung entscheiden, k&ouml;nnen Sie nun w&auml;hlen, ob die Achsen <b>sichtbar</b> oder verborgen sein sollen.<br>
<br>
</li>
<li>Im Falle sichtbarer Koordinatenachsen k&ouml;nnen Sie w&auml;hlen,
<ul>
<li>ob die Achsen mit <b>Zahlen</b> beschriftet werden sollen oder nicht, und</li>
<li>ob zus&auml;tzlich zu Achsen und Ursprung auch noch <b>Gitterpunkte</b> markiert werden sollen oder nicht.<br></li>
</ul><br>
</li>
<li>Falls Sie Gitterpunkte anzeigen lassen wollen, k&ouml;nnen Sie die <b>Dichte</b> der Gitterpunkte verringern, indem Sie f&uuml;r den <b>relativen Abstand</b> zweier benachbarter angezeigter Gitterpunkte statt 1 nun 2 oder 5 w&auml;hlen.<br>
<font size="-1">Beachten Sie aber, dass sich diese Einstellung nur auf die <i>Darstellung</i> des Koordinatensystems auswirkt! Wenn Sie das Koordinatensystem skalieren wollen, m&uuml;ssen Sie den Zoom-Befehl (Men&uuml;punkt <nobr><i>Bearbeiten | Zeichnung...|...vergr&ouml;&szlig;ern/verkleinern</i></nobr>) benutzen.</font><br>
<br>
</li>
<li>Im Falle eines sichtbaren Koordinatensystems k&ouml;nnen Sie au&szlig;erdem die <b>Bezeichnungen der Achsen</b> editieren. Wenn Sie hier <u>nichts</u> eintragen, werden <u>keine</u> Bezeichnungen an den Achsen angezeigt. F&uuml;r die meisten F&auml;lle sollten die voreingestellten Achsenbezeichnungen "x" und "y" gen&uuml;gen.<br>
<br>
</li>
</ul>
<p>In einem weiteren Teilfenster namens "Achsen-Skalierung" k&ouml;nnen Sie die <b>Skalierung</b> des Koordinatensystems ver&auml;ndern. Normalerweise sollten Sie die Standard-Einstellung (isotrope Darstellung, also gleiche Einheit auf beiden Achsen) nicht ver&auml;ndern m&uuml;ssen. Sollten Sie sich dennoch f&uuml;r eine anisotrope Darstellung entscheiden, werden Sie schwer verst&auml;ndliche Winkel- und L&auml;ngenma&szlig;e zu verkraften haben. Daher ist das wahrscheinlich wichtigste Element in diesem Teilfenster der Knopf "Skalierung auf Standardwerte zur&uuml;cksetzen".<br>
</p>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="koordsysbasics.htm">Grunds&auml;tzliches zum Koordinatensystem</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>