<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Grunds&auml;tzliches zum Koordinatensystem</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Grundlagen">
        <PARAM NAME="Keyword" VALUE="Koordinatensystem">
</OBJECT>

<A NAME="idh_coordsystem"></A>

<H2>Grunds&auml;tzliches zum Koordinatensystem</H2>
<HR>

<P>Jede Zeichnung enth&auml;lt ein <B>kartesisches Koordinatensystem</B> mit L&auml;ngeneinheit 1 cm. Der Ursprung kann <B>verschoben</B> werden, indem Sie ihn mit der Maus <A HREF="JavaScript:HHCTRL.TextPopup(pop_drag,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">ziehen</A>. Dabei bewegen sich sowohl die Achsen als auch alle geometrischen Objekte mit. Zahl- und Termobjekte hingegen bleiben an ihrem Platz. Textboxen werden nur dann mitbewegt, wenn sie an Objekte der Zeichnung gebunden sind; andernfalls bleiben sie ebenfalls an ihrem Platz.</P>

<P>Das Koordinatensystem kann verborgen sein, ist aber <B>stets verf&uuml;gbar</B>. Dies bedeutet, dass Sie auch <u>dann</u> einen Punkt mit festen Koordinaten erzeugen k&ouml;nnen, wenn <u>kein</u> Koordinatensystem angezeigt wird. Wenn Sie die Gr&ouml;&szlig;e Ihrer Zeichnung &auml;ndern, wird das Koordinatensystem mitskaliert.</P>

<P>Obwohl sich EUKLID DynaGeo zun&auml;chst bem&uuml;ht, das Koordinatensystem mit der Einheit 1 cm einzurichten, wird das angezeigte Koordinatensystem auf Ihrem Bildschirm sehr wahrscheinlich nicht genau <B>ma&szlig;haltig</B> sein. Es ist jedoch ohnehin nicht n&ouml;tig, dass Sie mit Geodreieck und Zirkel auf Ihrem Bildschirm herumkratzen, da alle Messungen in EUKLID DynaGeo softwarem&auml;&szlig;ig durchgef&uuml;hrt werden k&ouml;nnen. <B>Ausdrucke</B> sollten &uuml;brigens weitgehend ma&szlig;haltig sein, solange Sie Ihre Zeichnung nicht vergr&ouml;&szlig;ert oder verkleinert haben: sie k&ouml;nnen daher mit Zirkel und Lineal weiterbearbeitet werden: der Windows-Drucker-Zentimeter ist eben weitaus verl&auml;sslicher als der Windows-Bildschirm-Zentimeter!</P>

<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="koordsys.htm">Koordinatensystem</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>