<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Lizenzbedingungen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Lizenzbedingungen">
        <PARAM NAME="Keyword" VALUE="Lizenz">
</OBJECT>

<A NAME="idh_cm_Licence"></A>

<H2>Lizenzbedingungen und Haftungsausschluss</H2>
<HR>

<P>Das Programm EUKLID DynaGeo wird ab der Version 4.0 als <B>Freeware</B> zur Verf&uuml;gung gestellt, und zwar in Form eines Installations-Archivs im "Download-Bereich" der DynaGeo-Site. Jeder darf das Programm unentgeltlich f&uuml;r seine eigenen Zwecke benutzen. Die Weitergabe des Installations-Archivs an Dritte ist erw&uuml;nscht, muss aber in jedem Fall kostenlos erfolgen. Der Unterrichtseinsatz an Schulen und &auml;hnlichen Bildungseinrichtungen ist explizit erlaubt: EUKLID DynaGeo soll benutzt werden! Wenn Sie mit Hilfe von DynaGeo Unterrichts-Materialien erstellt haben, dann sind diese <u>Ihr</u> geistiges Eigentum. Mithin d&uuml;rfen Sie diese Materialien auch kommerziell verwerten.</P>

<p>Allerdings werden die Quelltexte des Programms nicht offengelegt: EUKLID DynaGeo unterliegt nach wie vor <b>meinem Copyright</b>. Entsprechend bleiben auch alle Versuche verboten, den Geheimnissen der EXE-Datei durch "Reverse Engineering" auf die Spur zu kommen. </p>

<P><B>Alte DynaGeo-Lizenzen</B> behalten ihre G&uuml;ltigkeit: wird beim Start des Programms eine <b>DGL-Datei mit g&uuml;ltigen Lizenz-Daten</b> gefunden, dann werden diese im "About"-Fenster angezeigt. Werden keine oder nur ung&uuml;ltige Lizenzdaten gefunden, l&auml;uft EUKLID DynaGeo 4.0 (und alle folgenden Versionen) trotzdem ohne Einschr&auml;nkungen.</P>

<P>Ich habe das Programm mit der gr&ouml;&szlig;ten mir m&ouml;glichen Sorgfalt erstellt. Trotzdem lassen sich Fehler nie ganz vermeiden. Ich kann jedoch <B>weder die juristische Verantwortung noch irgendeine Haftung</B> f&uuml;r eventuelle Folgesch&auml;den &uuml;bernehmen, selbst wenn sie auf Programmfehler oder fehlerhafte Angaben in den Begleitunterlagen des Programms zur&uuml;ckzuf&uuml;hren sind. Weiterhin &uuml;bernehme ich auch <B>keine Garantie</B> daf&uuml;r, dass die im Programm enthaltenen Funktionen den Anforderungen des Benutzers gen&uuml;gen oder dass der Programmbetrieb reibungslos und fehlerfrei abl&auml;uft.</P>

<P>Da ich jedoch ein Interesse daran habe, dass Sie mit EUKLID DynaGeo zufrieden sind, bin ich f&uuml;r <B>Hinweise</B> auf eventuelle <B>Fehler</B> oder m&ouml;gliche <B>Verbesserungen</B> jederzeit dankbar.</P>
<br>
<br>
</FONT>
</BODY>
</HTML>