<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Hintergrundbild laden</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Datei">
        <PARAM NAME="Keyword" VALUE="Zeichnung">
        <PARAM NAME="Keyword" VALUE="Hintergrundbild">
</OBJECT>

<A NAME="idh_cm_Image"></A>

<H2>Hintergrund-Bild laden&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/ToolPicture.gif" ALT="" BORDER=0></H2>
<HR>

<P>Es wird ein Dialogfenster ge&ouml;ffnet, das Ihnen die Auswahl einer <b>Grafik-Datei</b> erlaubt. Die unterst&uuml;tzten Datei-Formate sind:<br>
<ul><b>bmp</b>, <b>jpg</b>, <b>jpeg</b>, <b>wmf</b>, <b>emf</b> und <b>png</b>.    </ul>
Es wird Ihnen eine Liste der im aktuellen Verzeichnis vorgefundenen Grafik-Dateien gezeigt. Sie k&ouml;nnen wie &uuml;blich auch das aktuelle Verzeichnis sowie das Laufwerk wechseln, um auf andernorts gespeicherte Grafik-Dateien zuzugreifen. Wenn Sie Ihre Auswahl best&auml;tigen (<I>Okay</I>), wird die gew&auml;hlte Datei ge&ouml;ffnet und die darin gespeicherten Grafik als Hintergrundbild f&uuml;r die aktuelle Zeichnung verwendet.</P>
<br>

<p>Im <b>Kontextmen&uuml;</b> eines Bildes finden Sie die folgenden Eintr&auml;ge:<br>
<ul>
<li><b>Bild verbergen </b>:<br>
<ul>Mit diesem Befehl k&ouml;nnen Sie ein Bild genau so verbergen, wie jedes andere Objekt Ihrer Zeichnung auch.<br>
</ul><br>
</li>
<li><b>Bildrahmen anzeigen / Bild fixieren </b>:<br>
<ul>Normalerweise haben Hintergrund-Bilder einen festen Ort und eine feste Gr&ouml;&szlig;e. Nach dem Laden wird ein Bild zun&auml;chst in der Fenstermitte zentriert und ohne Rahmen dargestellt. In diesem Zustand k&ouml;nnen weder Ort noch Gr&ouml;&szlig;e des Bildes ver&auml;ndert werden.<br>
Wenn Sie den Befehl <b>"Bildrahmen anzeigen"</b> anw&auml;hlen, erscheint ein grauer Rahmen um das Bild. In diesem Zustand k&ouml;nnen Sie das Bild als Ganzes verschieben sowie (durch Ziehen am Rahmen) seine Gr&ouml;&szlig;e anpassen. Ziehen Sie an den Ecken des Bildes, wenn Sie seine Gr&ouml;&szlig;e unter Beibehaltung des urspr&uuml;nglichen  Seitenverh&auml;ltnisses anpassen wollen. <br>
Ist das Bild schlie&szlig;lich in der richtigen Gr&ouml;&szlig;e und an der gew&uuml;nschten Position, sollten Sie den umgekehrten Befehl <b>"Bild fixieren"</b> anwenden, um den Rahmen wieder zu verbergen und das Bild so gegen unbeabsichtigte Verschiebungen oder Gr&ouml;&szlig;en&auml;nderungen zu sch&uuml;tzen.<br>
</ul><br>
</li>
<br>
</ul>
</p>

<p>
<font color="$FF0000"><b><i> Achtung !</i></b></font>
<ul>Die Grafik-Daten werden nicht verkn&uuml;pft, sondern <u>eingebettet</u>. &Auml;nderungen, die nach dem Laden des Hintergrundbildes an der Originaldatei vorgenommen werden, haben also keinen Einfluss mehr auf das Hintergrund-Bild.</ul>
</p>

<br>
</FONT>
</BODY>
</HTML>