<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Grunds&auml;tzliches zum L&ouml;schen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Objekte">
        <PARAM NAME="Keyword" VALUE="L&ouml;schen">
        <PARAM NAME="Keyword" VALUE="Grundlagen">
</OBJECT>

<A NAME="idh_DelBasics"></A>

<H2>Grunds&auml;tzliches zum L&ouml;schen</H2>
<HR>

<P>Wenn ein <B>Objekt gel&ouml;scht</B> wird, dann wird es nicht mehr auf dem Bildschirm angezeigt. Es ist jedoch <B>noch nicht physikalisch gel&ouml;scht</B>, sondern wird an geheimer Stelle aufbewahrt f&uuml;r den Fall, dass Sie sich entschlie&szlig;en, die L&ouml;schung zu widerrufen. Tats&auml;chlich verh&auml;lt sich ein solches <B>l&ouml;schmarkiertes Objekt</B> intern fast wie ein aktives (d.h. nicht gel&ouml;schtes), aber verborgenes Objekt; wie dieses erscheint es <B>nicht auf dem Bildschirm</B> und kann damit auch nicht mehr als Elter f&uuml;r andere Objekte dienen.</P>

<P>Schleppt nun jede EUKLID DynaGeo - Zeichnung all diese l&ouml;schmarkierten Objekte f&uuml;r immer und ewig mit sich herum? </P>

<P>Nein, nat&uuml;rlich nicht: wenn Sie Ihre <B>Zeichnung abspeichern</B>, dann werden zuvor alle l&ouml;schmarkierten Objekte tats&auml;chlich und <B>physikalisch gel&ouml;scht</B>. Danach sind sie aber endg&uuml;ltig und unwiederbringlich weg. F&uuml;r die Speicherung in der EUKLID DynaGeo - Datei bleiben dadurch also nur aktive Objekte &uuml;brig.</P>

<P>Solange Sie Ihre Zeichnung nicht abspeichern, bleiben alle l&ouml;schmarkierten Objekte erhalten und k&ouml;nnen mit <I>Letzte L&ouml;schung widerrufen</I> wieder aktiviert werden.  Wenn Ihre Zeichnung nun aber neben den 3 aktiven Objekten, auf die es Ihnen eigentlich ankommt, noch 500 l&ouml;schmarkierte enth&auml;lt, welche durch ihre stille Teilnahme an dem Geschehen z.B. den Zugmodus qu&auml;lend verlangsamen, dann sollten Sie die Zeichnung einfach mal abspeichern.</P>
<br>
<br>
</FONT>
</BODY>
</HTML>