<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Neues Makro erstellen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Makros">
</OBJECT>

<A NAME="idh_cm_DefMakro"></A>

<H2>Neues Makro erstellen</H2>
<HR>

<P>Bevor Sie ein neues Makro erstellen k&ouml;nnen, m&uuml;ssen Sie die Konstruktion, die dieses Makro ausf&uuml;hren soll, zun&auml;chst einmal vollst&auml;ndig durchf&uuml;hren. Erstellen Sie also eine Zeichnung, die die Makro-Konstruktion vollst&auml;ndig enth&auml;lt. Das neue Makro wird dann in 3 Schritten erstellt:</P>

<OL>
        <LI>Nach dem Anw&auml;hlen dieses Men&uuml;befehls erscheint in der linken oberen Ecke des Zeichenblattes ein Fenster, das Sie auffordert, zun&auml;chst die <B>Startobjekte</B> des Makros einzugeben. Das Fenster enth&auml;lt als einzigen Inhalt einen Schalter <I>Okay,&nbsp;fertig</I>. Diesen m&uuml;ssen Sie dr&uuml;cken, nachdem Sie alle Startobjekte f&uuml;r das Makro mit der Maus angeklickt haben.<BR>
<BR>
Sollte beim Markieren der Startobjekte ein Mausklick nicht eindeutig einem Objekt zuzuordnen sein, wird eine <B>Auswahlbox</B> gezeigt, in der die Namen aller in Frage kommenden Objekte aufgelistet sind. W&auml;hlen Sie dann das gew&uuml;nschte Objekt aus dieser Liste aus.<BR>
<BR>
Sollte w&auml;hrend der Eingabe eines der gew&uuml;nschten Startobjekte von dem <I>Okay,&nbsp;fertig-</I>Fenster verdeckt sein, k&ouml;nnen Sie dieses Fenster (durch Anklicken in der Kopfzeile und anschlie&szlig;endes <A HREF="JavaScript:HHCTRL.TextPopup(pop_drag,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Ziehen</A>) an eine beliebige andere Stelle des Bildschirms bewegen.<BR>
<BR><BR></LI>

        <LI>Nach der Eingabe der Startobjekte ver&auml;ndert sich der Kopftext des kleinen Fensters: Sie werden aufgefordert, die <B>Zielobjekte</B> des Makros einzugeben. Dies geschieht auf dieselbe Art und Weise wie bei den Startobjekten. Schlie&szlig;en Sie die Eingabe der Zielobjekte ebenfalls mit einem Klick auf den Schalter <I>Okay,&nbsp;fertig</I>  ab. Dann wird dieses kleine Fenster geschlossen.<BR>
<BR>
Sollten Sie ein Zielobjekt markieren, das sich nicht aus den zuvor markierten Anfangsobjekten ableiten l&auml;sst, erhalten Sie eine Fehlermeldung, und die Makroerstellung wird abgebrochen.<BR>
<BR><BR></LI>

        <LI>Es &ouml;ffnet sich ein gr&ouml;&szlig;eres Dialogfenster, in dem Sie einen <B>Namen</B> f&uuml;r das Makro sowie einen erkl&auml;renden <B>Hilfetext</B> eingeben k&ouml;nnen. Der hier eingetragene Name wird nach der erfolgreichen Erstellung des Makros als neuer Eintrag am Ende des Makro-Men&uuml;s angef&uuml;gt. Der eingegebene Hilfetext wird sp&auml;ter immer dann angezeigt werden, wenn Hilfe zu einem Makroeintrag im Makromen&uuml; angefordert wird. Die verf&uuml;gbaren Tastaturbefehle zur Formatierung des Hilfetextes werden unter <a href="specialkeys.htm"><i>Tastatur und Maus | Spezialtasten</i></a> erkl&auml;rt.</LI>
</OL>

<P>Nachdem Sie diese 3 Schritte erfolgreich durchgef&uuml;hrt haben, ist das neue Makro erstellt und wird ins Makromen&uuml; eingetragen.</P>
<br>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="makrodetails.htm">Details zu Makros</a></li>
</ul>
<br>
<br>
</FONT>
</BODY>
</HTML>