<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Fl&auml;cheninhalt messen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Fl&auml;che">
        <PARAM NAME="Keyword" VALUE="Messen">
</OBJECT>

<A NAME="idh_cm_MeasureArea"></A>

<H2>Fl&auml;cheninhalt messen&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../IMAGES/Toolb409.gif" ALT="" BORDER=0></H2>
<HR>

<P><font size="-1">(<a HREF="JavaScript:HHCTRL.TextPopup(pop_autorepeat,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">automatisch wiederholbar</a>)</font></P>

<P>Klicken Sie mit der linken Maustaste die Fl&auml;che an, deren <b>Inhalt</b> Sie messen wollen. Hierbei sind alle gef&uuml;llten Fl&auml;chen (au&szlig;er Winkelmarkierungen) zugelassen. </P>

<P>Dann wird der aktuelle Inhalt dieser Fl&auml;che berechnet und in einem kleinen Rechteck in der N&auml;he des Fl&auml;chenschwerpunkts angezeigt. Sie k&ouml;nnen die relative Position des kleinen Anzeige-Rechtecks ver&auml;ndern, indem Sie es (im Zugmodus) mit der Maus <A HREF="JavaScript:HHCTRL.TextPopup(pop_drag,popfont,10,10,-1,-1)" Title="Klicken Sie, um eine Definition zu sehen!">verziehen</A>.<br>
</P>
<br>

<P><b>Bemerkungen:</b>
<ul>
<li>Wenn EUKLID DynaGeo einen Algorithmus kennt, mit dem der gew&uuml;nschte Fl&auml;cheninhalt berechnet werden kann, dann wird nat&uuml;rlich dieser Algorithmus verwendet. Dies ist z.B. f&uuml;r Polygone und Kreisfl&auml;chen der Fall. Das Ergebnis ist dann mindest so genau wie die Anzeige. Bei kompliziert berandeten ("zugeschnittenen") Fl&auml;chen kennt das Programm jedoch keinen Berechnungsalgorithmus. Dann wird ein Sch&auml;tzwert f&uuml;r den Fl&auml;cheninhalt aus der Anzahl der zur Fl&auml;che geh&ouml;renden Pixel errechnet.<br>
<br>
</li>
<li>Wenn Sie in den "<i>Einstellungen</i>" auf der Registerkarte "<i>Messen</i>" die Option "Auch Polygon- und Kreisfl&auml;chen orientiert messen" aktiviert haben, dann ber&uuml;cksichtigt EUKLID DynaGeo bei der Berechnung des Fl&auml;cheninhalts die Orientierung der Randkurve dieser Fl&auml;che. Fl&auml;chen, die mathematisch negativ umlaufen werden (also <b>im</b> Uhrzeigersinn), haben dann einen negativen Fl&auml;cheninhalt.<br>
<br>
</li>
</ul>
</P>

<br>
<br>
</FONT>
</BODY>
</HTML>