<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Men&uuml; Hilfe</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">

<A NAME="idh_menu_help"></A>

<H2>Men&uuml; Hilfe</H2>
<HR>

<P>Hier erhalten Sie zur Laufzeit des Programms Hilfen zu EUKLID DynaGeo. Dar&uuml;berhinaus bietet dieses Men&uuml; Informationen &uuml;ber die Lizenzbedingungen an, sowie eine M&ouml;glichkeit, das Programm zu registrieren. </P>
<br>

<P><b>Inhaltsverzeichnis</b><br>
<ul>F&uuml;hrt zum Inhaltsverzeichnis der EUKLID DynaGeo - Hilfe.</ul><br>
</P>

<P><b>Hilfe zum aktuellen Befehl</b><br>
<ul>Wenn Sie diesen Men&uuml;befehl w&auml;hlen, erscheint eine Hilfe zum aktuell aktiven Befehl. Ist im Augenblick kein Befehl aktiv (d.h. Sie sind im <A HREF="JavaScript:HHCTRL.TextPopup(pop_drag,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Zugmodus</A>!), dann wird das Inhaltsverzeichnis der Hilfe angezeigt.</ul><br>
</P>

<P><b><a href="grundlagen.htm">Grundlagen</a></b><br>
<ul>F&uuml;hrt zu einem Text, der die Grundideen des EUKLID DynaGeo - Programms erl&auml;utert.</ul><br>
</P>

<P><b><a href="euklwindow.htm">Das EUKLID DynaGeo - Fenster</a></b><br>
<ul>Erkl&auml;rt das &auml;u&szlig;ere Erscheinungsbild des EUKLID DynaGeo - Programms.</ul><br>
</P>

<P><b><a href="tastaturmaus.htm">Tastatur und Maus</a></b><br>
<ul>Gibt eine &Uuml;bersicht &uuml;ber die M&ouml;glichkeiten der Steuerung des EUKLID DynaGeo - Programms.</ul><br>
</P>

<P><b><a href="lizbed.htm">Lizenzbedingungen</a></b><br>
<ul>Zeigt die Lizenzbedingungen an.</ul><br>
</P>

<P><b><a href="register.htm">Registrierung...</a></b><br>
<ul>Dieser Befehl steht nur in der Freeware-Version zur Verf&uuml;gung: er &ouml;ffnet ein Dialogfenster, mit dessen Hilfe Sie aus der FreeWare-Version durch den Import einer DGL-Datei eine lizenzierte Vollversion mit pers&ouml;nlichen Daten machen k&ouml;nnen -- ohne irgend welche &Auml;nderungen der Programm-Funktionalit&auml;t zu erhalten.</ul><br>
</P>

<P><b>&Uuml;ber EUKLID DynaGeo...</b><br>
<ul>Ruft das Titelfenster auf, in dem die Versions-Nummer sowie die Daten der vorliegenden Lizenz des Programms aufgef&uuml;hrt sind.</ul><br>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>