<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Lokales Menu der "Einstellungen"</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Einstellungen">
        <PARAM NAME="Keyword" VALUE="Optionen">
        <PARAM NAME="Keyword" VALUE="Konfigurationsdatei">
        <PARAM NAME="Keyword" VALUE="Lizenz">
</OBJECT>

<A NAME="idh_opt_konfdat"></A>

<H2>Einstellungen | Men&uuml; Konfigurations-Datei</H2>
<HR>

<P>Das lokale Men&uuml; im <I>Einstellungen</I> - Fenster werden Sie voraussichtlich eher selten brauchen. Es enth&auml;lt die folgenden sechs Eintr&auml;ge:</P>
<ul>
<li><p><b>Standardeinstellungen laden</b><br>
Dieser Befehl setzt alle Einstellungen der Objektdarstellung auf die Standardwerte zur&uuml;ck.</p></li>

<li><p><b>Benutzereinstellungen laden</b><br>
Hier k&ouml;nnen Sie die zuvor abgespeicherten benutzerdefinierten Einstellungen des Programms wieder laden. Dies geschieht bei jedem Programmstart zun&auml;chst automatisch. Wenn Sie aber (etwa zur Probe) die Einstellungen ver&auml;ndert haben, ohne sie abzuspeichern, k&ouml;nnen Sie die Ver&auml;nderungen mit diesem Befehl wieder r&uuml;ckg&auml;ngig machen.</p></li>

<li><p><b>Benutzereinstellungen speichern</b><br>
Mit diesem Befehl k&ouml;nnen Sie Ihre eigenen Einstellungen abspeichern. Beim n&auml;chsten Programmstart werden diese dann automatisch gelesen, so dass Sie mit denselben Darstellungs-Optionen arbeiten k&ouml;nnen wie zuvor.</p></li>
</ul>
<br>
<p>Die letzten drei Men&uuml;punkte sind <b>nur f&uuml;r Administratoren zug&auml;nglich</b>, also f&uuml;r solche Benutzer, die schreibenden Zugriff auf die zentrale Konfigurationsdatei DYNAGEO.INI im DynaGeo-Verzeichnis haben.</p>
<ul>
<li><p><b>Aktuelle User-Einstellungen als Standard speichern</b><br>
Dieser Befehl erlaubt dem Administrator, seine aktuellen privaten Einstellungen als <b>Standard-Einstellungen</b> f&uuml;r alle Benutzer abzuspeichern. Durch geeignete <a href="netopt.htm">Netzwerk-Einstellungen</a> kann man dann erzwingen, dass alle Benutzer mit diesen Einstellungen arbeiten <b>m&uuml;ssen</b>.</p>
</li>

<li><p><b>Lizenzdaten aktualisieren</b><br>
Mit diesem Befehl k&ouml;nnen Sie bei einer lizenzierten Vollversion neue Lizenzdaten aus einer DGL-Datei einlesen. Dies ist nur dann n&ouml;tig, wenn sich Ihre Lizenzdaten ge&auml;ndert haben, z.B. bei einem Upgrade von einer Schullizenz auf eine Erweiterte Schullizenz.</p>
</li>

<li><p><b>Netzwerk-Einstellungen...</b><br>
Dieser Befehl f&uuml;hrt zu einem Dialog, in dem der Administrator die Vorgaben f&uuml;r alle Benutzer der vorliegenden Version von EUKLID DynaGeo im lokalen Netz festlegen kann. Details zu diesem nicht ganz einfachen Thema finden Sie im Abschnitt <a href="netopt.htm">Netzwerk-Einstellungen</a>.</p>
</li>
</ul>
<br>
<P>Normalerweise werden die gew&auml;hlten Einstellungen beim Beenden des Programms automatisch gespeichert, so dass Sie die ersten 3 Men&uuml;punkte nur in Ausnahmef&auml;llen brauchen werden. Die letzten beiden Men&uuml;punkt sollten Sie ebenfalls sparsam einsetzen: benutzen Sie sie nur, wenn Sie genau wissen, was Sie tun!</P>
<br>
<br>
</FONT>
</BODY>
</HTML>