<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Objekt l&ouml;schen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Bearbeiten">
        <PARAM NAME="Keyword" VALUE="Objekte">
        <PARAM NAME="Keyword" VALUE="L&ouml;schen">
</OBJECT>

<A NAME="idh_cm_DelObj"></A>

<H2>Objekt l&ouml;schen&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/toolb107.gif" ALT="" BORDER=0></H2>
<HR>

<P><font size="-1">(<a HREF="JavaScript:HHCTRL.TextPopup(pop_autorepeat,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">automatisch wiederholbar</a>)</font></P>


<P>Sie m&uuml;ssen zun&auml;chst das zu l&ouml;schende Objekt mit der Maus anklicken. Wenn es andere Objekte gibt, die von dem zu l&ouml;schenden Objekt abh&auml;ngen, weil sie n&auml;mlich mit seiner Hilfe konstruiert wurden, dann werden das Objekt und diese seine Nachkommen gr&uuml;n markiert, und Sie werden gefragt, ob Sie diese Objekt wirklich alle l&ouml;schen wollen. Falls ja, wird das L&ouml;schen durchgef&uuml;hrt, andernfalls nicht.</P>

<P>Wenn Sie ein Objekt l&ouml;schen wollen, das keine Nachkommen hat, dann wird die L&ouml;schung sofort und ohne Nachfrage durchgef&uuml;hrt, nachdem Sie das Objekt angeklickt haben.</P>

<P>Wenn Sie das <B>Koordinatensystem l&ouml;schen</B> wollen, erscheint eine Meldung, die Sie dar&uuml;ber informiert, dass das Koordinatensystem nicht gel&ouml;scht, sondern nur verborgen werden kann; gel&ouml;scht werden lediglich die Fixierungen von Koordinatenpunkten. Wenn Sie dies wollen, dann werden alle Koordinatenpunkte in Basispunkte umgewandelt und anschlie&szlig;end das Koordinatensystem verborgen. Wollen Sie die Koordinatenpunkte als solche erhalten, m&uuml;ssen Sie das Koordinatensystem &uuml;ber den Befehl <i>Objekt verbergen / anzeigen</i> verbergen.</P>
<br>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="loeschbasics.htm">Grunds&auml;tzliches zum L&ouml;schen</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>