<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Objekt benennen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Bearbeiten">
        <PARAM NAME="Keyword" VALUE="Objekte">
        <PARAM NAME="Keyword" VALUE="Editieren">
</OBJECT>

<A NAME="idh_cm_NameObj"></A>

<H2>Objekt benennen&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/toolb105.gif" ALT="" BORDER=0></H2>
<HR>

<P><font size="-1">(<a HREF="JavaScript:HHCTRL.TextPopup(pop_autorepeat,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">automatisch wiederholbar</a>)</font></P>

<P>Zun&auml;chst m&uuml;ssen Sie eines der aktuell sichtbaren Objekte der Zeichnung mit der Maus anklicken; dann &ouml;ffnet sich ein Dialogfenster, in dem Sie dem Objekt einen <B>neuen Namen</B> geben k&ouml;nnen. Jedes Objekt bekommt bei seiner Erstellung einen eindeutigen Namen, der sich aus einem Kennbuchstaben (f&uuml;r die Objektart, also z.B. <B>P</B> f&uuml;r Punkte, <B>g</B> f&uuml;r Geraden und <B>s</B> f&uuml;r Strecken) und einer laufenden Nummer zusammensetzt. Sie d&uuml;rfen jedoch hier einen beliebigen Namen eingeben. Allerdings pr&uuml;ft EUKLID DynaGeo, ob der Name unzul&auml;ssige Zeichen enth&auml;lt oder ob er etwa schon zur Bezeichnung eines anderen Objekts verwendet wurde. Sollte dies der Fall sein, erhalten Sie eine entsprechende Meldung.</P>
<br>

<p>Objektnamen m&uuml;ssen den folgenden <b>Bedingungen</b> gen&uuml;gen:<br>
<ul>
<li><b>Zugelassene Zeichen</b> in Namen sind gro&szlig;e und kleine Buchstaben (auch die deutschen Sonderzeichen sowie Vokale mit Akzenten) sowie die Ziffern.<br>
<br>
</li>
<li>Ein Name darf <b>kein Leerzeichen</b> enthalten. Die einzigen zur optischen Trennung zugelassenen Zeichen sind der Tiefstrich ("_") und die Raute ("#"); allerdings darf ein Name nicht mit einem solchen Zeichen beginnen!<br>
<br>
</li>
<li>Weitere <b>nicht zugelassene Zeichen</b> sind alle Satzzeichen, Rechenzeichen (also "+", "-", "*", "/", "^", "&", "\") sowie alle Klammern.<br>
<br>
</li>
</ul>
</p>
<br>

<P>Die zu verwendende Standard-Schriftart k&ouml;nnen Sie unter den "<i>Einstellungen</i>" auf der Registerkarte "<a href="optkonstrtext.htm"><i>Texte</i></a>" festlegen. Voreingestellt ist eine 12 Punkte hohe Arial-Schrift; f&uuml;r Winkelbezeichnungen wird standardm&auml;&szlig;ig der Symbolfont gew&auml;hlt, um griechische Buchstaben zu erhalten. Sie k&ouml;nnen jedoch mit der Auswahlbox am oberen Fensterrand aus allen installierten <B>Schriftarten</B> eine beliebige ausw&auml;hlen. Mit dem danebenstehenden Editierfeld k&ouml;nnen Sie eine frei w&auml;hlbare <B>Schriftgr&ouml;&szlig;e</B> einstellen. Au&szlig;erdem sind &uuml;ber weitere Schaltfelder die &uuml;blichen <b>Schriftattribute</b> (fett, kursiv, unterstrichen, hoch- bzw. tiefgestellt) verf&uuml;gbar; beachten Sie, dass sich ein Klick auf einen dieser "Formatierungskn&ouml;pfe" immer nur auf den aktuell <b>selektierten Text</b> auswirkt!</P>

<p>Ein benanntes Objekt kann hinter seinem Namen noch weitere <b>Daten anzeigen</b>: bei Punkten und Vektoren sind dies die aktuellen Koordinaten, bei Geraden und Kreisen die jeweilige Gleichung. Um die Anzeige dieser Daten zu veranlassen, gibt es im <A HREF="JavaScript:HHCTRL.TextPopup(pop_contextmenu,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Kontext-Men&uuml;</A> eines Objekts, dessen Name sichtbar ist, einen zus&auml;tzlichen Eintrag "<i>Koordinaten anzeigen</i>" bzw. "<i>Gleichung anzeigen</i>". Wenn Sie diesen Men&uuml;punkt anw&auml;hlen, werden hinter dem Objektnamen die zugeh&ouml;rigen Objektdaten angezeigt. </p>
<br>

<P>Wenn Sie das Dialogfenster mit einem Klick auf den <I>Okay</I>-Schalter verlassen, erh&auml;lt das Objekt den neu eingegebenen Namen; verlassen Sie es &uuml;ber den <I>Abbrechen</I>-Schalter, dann beh&auml;lt das Objekt seinen alten Namen.</P>
<br>


<br>
</FONT>
</BODY>
</HTML>