<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Korrektheit &uuml;berpr&uuml;fen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Konstruktion">
        <PARAM NAME="Keyword" VALUE="Beweis">
        <PARAM NAME="Keyword" VALUE="Korrektheit">
</OBJECT>

<A NAME="idh_cm_OkCheckRun"></A>

<H2>Korrektheit &uuml;berpr&uuml;fen&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/toolCheckSol2.gif" ALT="" BORDER=0></H2>
<HR>

<P>Dieser Befehl startet die &Uuml;berpr&uuml;fung, ob die vorliegende Konstruktion die gestellte Aufgabe l&ouml;st. Er ist nur dann verf&uuml;gbar, wenn die aktuelle Zeichnung eine Korrektheits-Bedingung enth&auml;lt und EUKLID DynaGeo damit diese Frage entscheiden kann.</P>

<p>Zun&auml;chst sind die <b>Ziel-Objekte</b> der Konstruktion in der Reihenfolge einzugeben, wie es der Aufgabensteller vorgesehen hat. Dabei kann ein Hinweis helfen, der in der Status-Zeile am unteren Fensterrand erscheint - genau wie bei jedem anderen Befehl auch.</p>

<p>Nach der Eingabe des letzten Ziel-Objekts wird die <b>Korrektheits-Pr&uuml;fung</b> durchgef&uuml;hrt.</p>

<p> Schlie&szlig;lich erscheint ein Fenster, das &uuml;ber das <b>Pr&uuml;fungs-Ergebnis</b> Auskunft gibt:<br>
<ul>
<li>Hat die Konstruktion die Pr&uuml;fung erfolgreich bestanden, gilt sie als <b>korrekt</b>. Wenn der Aufgabensteller f&uuml;r diesen Fall das Weiterschalten zu einer n&auml;chsten Aufgabe vorgesehen hat, wird in dem Ergebnis-Fenster eine entsprechende M&ouml;glichkeit angeboten. Gegebenenfalls wird nach dem Schlie&szlig;en des Ergebnis-Fensters diese neue Aufgabe geladen.<br>
<br>
</li>
<li>Erweist sich die Konstruktion als <b>falsch</b>, wird dies ebenfalls in einem Ergebnis-Fenster mitgeteilt. Wenn der Aufgabensteller auch f&uuml;r diesen Fall die Umschaltung zu einer anderen (m&ouml;glicherweise fr&uuml;heren) Aufgabe vorgesehen hat, dann bietet das Fenster eine entsprechende M&ouml;glichkeit an. Nach dem Schlie&szlig;en des Ergebnis-Fensters wird dann diese Aufgabe geladen, sofern der Benutzer dies w&uuml;nscht. Es kann aber auch sinnvoll sein, diese automatische Umschaltung abzuw&auml;hlen und die aktuelle Konstruktion nochmals kritisch zu &uuml;berpr&uuml;fen und zu korrigieren.</li>
</ul>
</p>

<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="okcheck.htm">Korrektheit &uuml;berpr&uuml;fen</a></li>
<li><a href="okcheckcfg.htm">Korrektheits-Pr&uuml;fung konfigurieren</a></li>
</ul>
</P>
<br>
</FONT>
</BODY>
</HTML>