<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Korrektheits-Pr&uuml;fung konfigurieren</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Konstruktion">
        <PARAM NAME="Keyword" VALUE="Beweis">
        <PARAM NAME="Keyword" VALUE="Korrektheit">
</OBJECT>

<A NAME="idh_cm_OkCheckCfg"></A>

<H2>Korrektheits-Pr&uuml;fung konfigurieren</H2>
<HR>
<br>
EUKLID DynaGeo bietet Lehrern die M&ouml;glichkeit, Arbeitsbl&auml;tter zu erstellen, bei denen die Korrektheit einer vom Sch&uuml;ler durchgef&uuml;hrten Konstruktion automatisch vom Programm &uuml;berpr&uuml;ft werden kann. In diesem Fenster k&ouml;nnen Sie als Autor eines entsprechenden Arbeitsblattes diese automatische Korrektheits-&Uuml;berpr&uuml;fung konfigurieren:<br>
<br>
<br>
<ul>
<li>In das Feld <font color="#0000FF"><i>"Korrektheits-Bedingung"</i></font> geben Sie einen boole'schen Term ein, der genau dann wahr ist, wenn die Konstruktion korrekt ist. Details zur Syntax boole'scher Terme finden Sie im Abschnitt <a href="okcheck.htm">Die Korrektheits-Pr&uuml;fung</a>.<br>
<br>
</li>
<li>In die darunterstehenden <font color="#0000FF">Tabelle</font> werden alle in der Korrektheitsbedingung verwendeten Standard-Variablen eingetragen. W&auml;hlen Sie bitte zu jeder der hier aufgef&uuml;hrten Variablen aus, von welchem der angebotenen Objekttypen das zu erwartende Zielobjekt der Konstruktion sein soll.<br>
<br>
</li>
<li>In das Feld <font color="#0000FF"><i>"Hinweis-Text"</i></i></font> k&ouml;nnen Sie einen Hilfe-Text eintragen, der dem Sch&uuml;ler bei der Eingabe der Ziel-Objekte seiner Konstruktion f&uuml;r die Korrektheits-Pr&uuml;fung helfen soll.<br>
<br>
</li>
<li>Die letzten beiden Editierfelder k&ouml;nnen <font color="#0000FF"><i>"Links"</i></font> zu Folge-Aufgaben enthalten, und zwar getrennt f&uuml;r die beiden F&auml;lle der erfolgreichen und der nicht erfolgreichen Bearbeitung der aktuellen Konstruktions-Aufgabe. Tragen Sie hier die jeweils gew&uuml;nschte GEO-Datei ein. Befinden sich alle Dateien im selben Verzeichnis, dann gen&uuml;gt der Dateiname; andernfalls geben Sie bitte den <b>relativen Pfad</b> von der aktuellen zu der gew&uuml;nschten n&auml;chsten Datei an.<br>
Sie k&ouml;nnen diese beiden Felder aber auch leer lassen, wenn es (noch) keine passenden Aufgaben gibt.<br>
</li>
</ul>
<br>

<p>Wenn Sie das Fenster mit einem Klick auf den <i>"Okay"</i>-Knopf schlie&szlig;en, werden Ihre &Auml;nderungen in die aktuelle Zeichnung geschrieben. Schlie&szlig;en Sie das Fenster dagegen mit dem <i>"Abbrechen"</i>-Knopf, werden Ihre &Auml;nderungen verworfen.</p>

<br>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="okcheck.htm">Die Korrektheits-Pr&uuml;fung</a></li>
<li><a href="okcheckrun.htm">Korrektheit &uuml;berpr&uuml;fen</a></li>
</ul>
</P>
<br>
</FONT>
</BODY>
</HTML>