<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Optionen f&uuml;r Ortslinien</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Einstellungen">
        <PARAM NAME="Keyword" VALUE="Optionen">
        <PARAM NAME="Keyword" VALUE="Ortslinien">
</OBJECT>

<A NAME="idh_opt_olines"></A>

<H2>Einstellungen | Ortslinien</H2>
<HR>

<P><B>Minimaler Abstand von Ortslinienst&uuml;tzpunkten:</B><br>
<ul>Beim Erzeugen einer Ortslinie wird erst dann ein neuer Punkt zur Ortslinie hinzugef&uuml;gt, wenn sich der erzeugende Punkt hinreichend weit von der letzten registrierten Lage entfernt hat. Hier legen Sie den entsprechenden Mindestabstand (in Pixeln) fest.<br>
Bereich:  [ 1 ........ (<b>10</b>) ........50 ]</ul><br>
</P>


<P><B>Neue Ortslinien als dynamische Objekte erzeugen:</B><br>
<ul>Ist diese Option angew&auml;hlt, wird (nach M&ouml;glichkeit) eine dynamische Ortslinie erzeugt, die am Zugmodus teilnimmt. Andernfalls wird lediglich eine statische Spur erzeugt. <BR>
Normalerweise: eingeschaltet.</ul><br>
</P>

<P><B>Neue Ortslinien als Kurven darstellen:</B><br>
<ul>Ist diese Option gew&auml;hlt, dann wird eine neu erzeugte Ortslinie durch eine Bezier-Kurve durch die aufgezeichneten bzw. errechneten St&uuml;tzpunkte dargestellt. Andernfalls werden die St&uuml;tzpunkte selbst dargestellt.<BR>
Normalerweise: eingeschaltet.</ul><br>
</P>

<P><B>Neue Ortslinien falls m&ouml;glich in Standardkurven konvertieren:</B><br>
<ul>Ist diese Option gew&auml;hlt, dann wird bei jeder neu erzeugten Ortslinie gepr&uuml;ft, ob die St&uuml;tzpunkte auf einer Geraden oder einem Kreis liegen. Wenn dies der Fall ist, fragt EUKLID DynaGeo nach, ob statt der Approximationskurve durch die St&uuml;tzpunkte im folgenden diese Gerade bzw. der Kreis angezeigt werden soll. Falls Sie diese Frage bejahen, wird bei folgenden Zugoperationen stets diese Gerade bzw. dieser Kreis angezeigt.<BR>
Normalerweise: ausgeschaltet.</ul><br>
</P>


<P><B>Neue Einh&uuml;llende als dynamische Objekte erzeugen:</B><br>
<ul>Ist diese Option angew&auml;hlt, wird (nach M&ouml;glichkeit) eine dynamische Einh&uuml;llende erzeugt, die am Zugmodus teilnimmt. Andernfalls wird lediglich eine statische Momentaufnahme der Einh&uuml;llenden erzeugt. <BR>
Normalerweise: eingeschaltet.</ul><br>
</P>

<P><B>Neue Einh&uuml;llende als Kurven darstellen:</B><br>
<ul>Ist diese Option gew&auml;hlt, dann wird eine neu erzeugte Einh&uuml;llende durch eine Bezier-Kurve durch die aufgezeichneten bzw. errechneten St&uuml;tzpunkte dargestellt. Andernfalls werden die St&uuml;tzpunkte selbst dargestellt.<BR>
Normalerweise: eingeschaltet.</ul><br>
</P>

<P><B>Die Geradenschar einer Einh&uuml;llenden nach dem Erzeugen weiterhin anzeigen:</B><br>
<ul>Ist diese Option gew&auml;hlt, dann wird bei jeder neu erzeugten Einh&uuml;llenden die definierende Geradenschar angezeigt; andernfalls wird nur die Einh&uuml;llende selbst gezeichnet. Dies ist im Normalfall zu bevorzugen, weil die gro&szlig;e Anzahl zus&auml;tzlicher Geraden meist mehr Verwirrung bringt als Nutzen. <BR>
Normalerweise: ausgeschaltet.</ul><br>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>