<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Darstellungs-Optionen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Einstellungen">
        <PARAM NAME="Keyword" VALUE="Optionen">
</OBJECT>

<A NAME="idh_opt_darst"></A>

<H2>Einstellungen | Darstellung</H2>
<HR>

<p><b>Standard-Punkt-Formen:</b><br>
<ul>Hier k&ouml;nnen Sie einstellen, welches &auml;u&szlig;ere Erscheinungsbild neu erzeugte Punkte haben sollen, und zwar getrennt f&uuml;r <b>Basispunkte</b> (bisher: gef&uuml;llte Quadrate) und <b>konstruierte Punkte</b> (bisher: gef&uuml;llte Kreise). Die beiden Kn&ouml;pfe zeigen die jeweils aktuell eingestellte Punktform. Wenn Sie auf einen der Kn&ouml;pfe klicken, erscheint ein Men&uuml;, aus dem Sie die von Ihnen gew&uuml;nschte Punktform ausw&auml;hlen k&ouml;nnen. Diese wird dann auf dem jeweiligen Knopf angezeigt. </ul><br>
</p>

<p><b>Standard-Linien-Stile:</b><br>
<ul>Hier k&ouml;nnen Sie einstellen, welches &auml;u&szlig;ere Erscheinungsbild neu erzeugte Linien haben sollen, und zwar getrennt f&uuml;r <b>normale Linien</b> (Strecken, Geraden und Kreise, bisher: d&uuml;nne, durchgezogene Linien) und <b>Ortslinien</b> (bisher: dicke durchgezogene Linien). Die beiden Kn&ouml;pfe zeigen den jeweils aktuell eingestellten Linienstil. Wenn Sie auf einen der Kn&ouml;pfe klicken, erscheint ein Men&uuml;, aus dem Sie den von Ihnen gew&uuml;nschten Linienstil ausw&auml;hlen k&ouml;nnen. Dieser wird dann auf dem jeweiligen Knopf angezeigt. </ul><br>
</p>

<P><B>Punktgr&ouml;&szlig;e:</B><br>
<UL>Dieser Parameter regelt die Gr&ouml;&szlig;e eines Punktes auf dem Bildschirm. Angegeben wird der Radius eines kreisf&ouml;rmig dargestellten Punktes in Pixeln.<br>
Bereich:  [ 2 ........ (<b>4</b>) ........ 10 ]</UL><br>
</P>

<P><B>Standard-Farbe des Koordinatensystems:</B><br>
<UL>Dieser Parameter regelt die <b>Farbe des Koordinatensystems</b> in einer <b>neu erzeugten Zeichnung</b>. Normalerweise wird das Koordinatensystem in einem hellen Grau dargestellt.</UL><br>
</P>

<P><B>Namenfarbe folgt der Objektfarbe:</B><br>
<UL>Wenn Sie diese Option w&auml;hlen, dann wird die Farbe f&uuml;r Objektnamen stets mit ge&auml;ndert, wenn Sie die Farbe des Objekts ver&auml;ndern. Andernfalls sind die beiden Farben voneinander unabh&auml;ngig.</UL><br>
</P>

<P><B>Rechten Winkel mit Punkt markieren:</B><br>
<ul>Wenn Sie diese Option w&auml;hlen, wird ein Rechter Winkel durch einen Punkt im Winkelbogen markiert. Andernfalls wird er durch einen rechtwinkligen Haken markiert.<BR>
Normalerweise: Ausgeschaltet.</ul><br>
</P>

<P><B>Winkelmarkierung gef&uuml;llt darstellen:</B><br>
<ul>Dieser Schalter entscheidet, ob die Markierung eines Winkels gef&uuml;llt dargestellt wird oder nicht. Wenn der Schalter aktiviert ist, erscheint der markierende Winkelbogen eines neu erzeugten Winkels gelb gef&uuml;llt. Wenn Sie die Farbe der Winkelmarkierung &auml;ndern, wird die Farbe der F&uuml;llung entsprechend angepasst. </ul>
</P>

<P><B>Ma&szlig;angaben mit Rahmen einfassen:</B><br>
<ul>Dieser Schalter entscheidet, ob die Ma&szlig;angaben in Ihren Zeichnungen mit einem Rahmen umfasst werden oder nicht. (Das ist eine Frage des pers&ouml;nlichen Geschmacks...)</ul>
</P>

<P><B>Polygone beim Erzeugen automatisch f&uuml;llen:</B><br>
<UL>Wenn Sie diese Option w&auml;hlen, dann wird jedes neu erzeugte Polygon gef&uuml;llt dargestellt. F&uuml;llmuster und F&uuml;llfarbe werden dabei automatisch so gew&auml;hlt, dass sie in dieser Kombination m&ouml;glichst noch nicht f&uuml;r eine Polygonf&uuml;llung verwendet worden sind.<BR>
Ist diese Option deaktiviert, dann werden neu erzeugte Polygone ungef&uuml;llt erstellt. Sie k&ouml;nnen sie jedoch jederzeit nachtr&auml;glich f&uuml;llen.</UL><br>
</P>

<br>
<br>
</FONT>
</BODY>
</HTML>