<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Optionen f&uuml;r die Text-Darstellung</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Einstellungen">
        <PARAM NAME="Keyword" VALUE="Optionen">
</OBJECT>

<A NAME="idh_opt_kons"></A>

<H2>Einstellungen | Texte</H2>
<HR>

<P><B>Standardfont f&uuml;r Beschriftungen...</B><br>
<ul>Diese Schaltfl&auml;che f&uuml;hrt zu einem Font-Auswahl-Dialog, mit dem Sie den Standard-Font f&uuml;r die Objektnamen vorgeben k&ouml;nnen. Obwohl hier die Manipulation s&auml;mtlicher Font-Parameter m&ouml;glich ist, sollten Sie keine zu exotischen Einstellungen w&auml;hlen, da diese auf einem anderen Rechner eventuell nicht realisiert werden k&ouml;nnen. &Uuml;blicherweise gen&uuml;gt es, die <B>Fontgr&ouml;&szlig;e</B> den eigenen Bed&uuml;rfnissen anzupassen.</ul>
</P>

<P><B>Keine Namen- und Ma&szlig;objekte im Konstruktionstext</B><br>
<ul>Wenn Sie diese Option anw&auml;hlen, werden im automatisch erzeugten Konstruktionstext nur die ”echten” geometrischen Objekte aufgef&uuml;hrt, nicht jedoch Namen-Objekte sowie L&auml;ngen- bzw. Winkelma&szlig;-Objekte. Andernfalls erhalten Sie eine vollst&auml;ndige Liste aller geometrischen Objekte Ihrer Konstruktion.</ul><br>
</P>

<P><B>Darstellung der Geradengleichungen:</B><br>
<ul>EUKLID DynaGeo kann hinter dem Namen einer Geraden auch deren Gleichung anzeigen. In dieser Auswahlbox k&ouml;nnen Sie entscheiden, in welcher Form diese Geradengleichungen erscheinen sollen:<br>
<br>
<ul>
<li><i><b>y = mx + c</b></i>:<br>
Dies ist die Standardform f&uuml;r Geradengleichungen im Mathematikunterricht der Mittelstufe. Leider lassen sich damit bekannterweise keine Geraden darstellen, die parallel zur y-Achse verlaufen; falls n&ouml;tig, wird daher auf eine Darstellung in der Form <i><b><nobr>x = a</nobr></b></i> umgeschaltet.<br>
<br></li>
<li><i><b>ax + by = c</b></i>:<br>
Diese Form der Geradengleichung wird vorwiegend in der Analytischen Geometrie der Oberstufe verwendet.<br>
<br></li>
</ul>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>