<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Ortslinie aufzeichnen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Konstruieren">
        <PARAM NAME="Keyword" VALUE="Ortslinien">
</OBJECT>

<A NAME="idh_cm_MakeLocLine"></A>

<H2>Ortslinie aufzeichnen&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/toolb108.gif" ALT="" BORDER=0></H2>
<HR>

<P>Klicken Sie zun&auml;chst mit der Maus denjenigen <B>Punkt</B> an, dessen Ortslinie sie erzeugen wollen, den sogenannten ”Generatorpunkt”. Danach k&ouml;nnen Sie wie im gew&ouml;hnlichen Zugmodus an einem <A HREF="JavaScript:HHCTRL.TextPopup(pop_baseobj,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Basispunkt</A> (dem ”Zugpunkt” der Ortslinie) ziehen, von dem der Generatorpunkt abh&auml;ngt. Wenn der Generatorpunkt dabei bewegt wird, hinterl&auml;sst er eine Serie von Punkten, die seine <B>alten Positionen</B> markieren. Sobald Sie nach dem Verziehen des Zugpunktes die linke Maustaste wieder losgelassen haben, wird die Ortslinie als (m&ouml;glichst) glatte Kurve durch die aufgezeichneten Punkte dargestellt.</P>

<P>Wollen Sie die <B>Ortslinien mehrerer Punkte</B> gleichzeitig aufzeichnen, dann halten Sie beim Markieren des ersten Generatorpunktes die <I>UMSCHALT</I>-Taste gedr&uuml;ckt. Dies signalisiert dem Programm, dass noch weitere erzeugende Punkte ausgew&auml;hlt werden sollen. Es erscheint ein Fenster, das nur einen <I>Okay, fertig </I>-Schalter enth&auml;lt. Klicken Sie nun (mit losgelassener <i>UMSCHALT</i>-Taste) alle weiteren Generatorpunkte an. Nach dem letzten Punkt klicken Sie auf <I>Okay, fertig</I>. Danach k&ouml;nnen Sie durch Verziehen eines Zugpunktes die Ortslinien erzeugen.</P>

<p>Der Zugpunkt kann auch durch ein Zahlobjekt ersetzt werden: statt an einem Basispunkt zu ziehen, k&ouml;nnen Sie auch an dem Einstellknopf eines Zahlobjektes ziehen, wenn nur die Koordinaten des Generatorpunktes von diesem Zahlobjekt abh&auml;ngen.</p>
<br>

<P><b>Bemerkungen:</b>
<ol start="1" type="1">
<li>Neue Ortslinien werden gem&auml;&szlig; den Voreinstellungen nach M&ouml;glichkeit als <a href="olinedyn.htm">dynamische</a> Ortslinien erzeugt.<br>
<br>
</li>
<li>Wenn Sie statt einer <b>dynamischen Ortslinie</b> nur eine <b>statische Spur</b> erzeugen wollen, dann dr&uuml;cken Sie bitte beim Ausw&auml;hlen des Befehls zus&auml;tzlich die <i>ALT-Taste</i>.<br>
<br>
</li>
<li>
Das <A HREF="JavaScript:HHCTRL.TextPopup(pop_contextmenu,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Kontextmen&uuml;</A> einer Ortslinie zeigt neben den &uuml;blichen Eintr&auml;gen zus&auml;tzlich die folgenden Men&uuml;punkte:<br>
<UL>
<LI><B>Dicke Linie</B> bzw. <B>D&uuml;nne Linie</B>:<br>
<ul>zum Umschalten der Linienst&auml;rke;<BR></ul>
</LI>
<LI><B>Als Punkte-Serie zeigen</B> bzw. <B>Als Kurve zeigen</B>:<br>
<ul>zum Umschalten der Darstellungsart;<BR></ul>
</LI>
<LI><B>Dynamisch</B>:<br>
<ul>zum Ein- bzw. Abschalten des dynamischen Modus;<BR></ul>
</LI>
</UL>
</li>
</ol>
</P>

<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="olinedyn.htm">Dynamische Ortslinien</a></li>
<li><a href="olinestandard.htm">Standard-Ortslinien</a></li>
<li><a href="einhuellende.htm">Einh&uuml;llende aufzeichnen</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>