<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Details zu Polygonen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Zeichnen">
        <PARAM NAME="Keyword" VALUE="N-Eck">
        <PARAM NAME="Keyword" VALUE="Polygon">
        <PARAM NAME="Keyword" VALUE="Linien">
</OBJECT>

<A NAME="idh_PolyDetails"></A>

<H2>Details zu Polygonen</H2>
<HR>
<P>
Im Gegensatz zu fr&uuml;heren Versionen von EUKLID DynaGeo, in denen ein Polygon als <b>Fl&auml;che</b> angesehen wurde, wird es nun als <b><font color="#FF0000">geschlossener Streckenzug</font></b> definiert: das Polygon ist <b>der Rand</b> der Polygonfl&auml;che!</P>

<p>Wenn Sie ein Polygon (mit dem Befehl <a href="3eck.htm"><i>Dreieck</i></a> oder <a href="neck.htm"><i>N-Eck</i></a>) erzeugen, werden zus&auml;tzlich auch seine Seitenstrecken (als individuell referenzierbare Objekte) erzeugt. Dadurch wird eine eigene Darstellung f&uuml;r das Polygon &uuml;berfl&uuml;ssig. Es ist somit f&uuml;r den Benutzer eigentlich unsichtbar und hat eher den virtuellen Charakter einer "Verwaltungseinheit" als den eines (im engeren Sinn) geometrischen Objekts. Auch wenn Sie alle Seiten(strecken) eines Polygons l&ouml;schen, ist das Polygon selbst nach wie vor in Ihrer Zeichnung vorhanden: Sie k&ouml;nnen auch dann noch einen Punkt an dieses Polygon binden oder die von ihm umschlossene Fl&auml;che berechnen!</p>

<p>Wollen Sie ein Polygon <b>gef&uuml;llt</b> darstellen, dann k&ouml;nnen Sie dies jederzeit nachtr&auml;glich mit dem Befehl <a href="areafill.htm"><i>Fl&auml;che f&uuml;llen</i></a> erreichen. Wollen Sie grunds&auml;tzlich nur gef&uuml;llte Polygone erstellen, k&ouml;nnen Sie in den <i>Einstellungen</i> auf der Registerseite <a href="optdarst.htm"><i>Darstellung</i></a> die Option "Polygone beim Erzeugen automatisch f&uuml;llen" aktivieren.</p>

<p>Obwohl die Polygone &uuml;ber keine eigene visuelle Darstellung verf&uuml;gen, k&ouml;nnen sie mit der Maus angew&auml;hlt werden, und man kann ihr <b>Kontextmen&uuml;</b> aufrufen. In diesem gibt es neben den &uuml;blichen Eintr&auml;gen ("Verbergen", "Benennen...") auch den Men&uuml;punkt "Farbe...". Wenn Sie hier eine neue Farbe setzen, werden alle Seiten des Polygons in dieser Farbe dargestellt. Ist eine F&uuml;llung vorhanden, dann wird diese mit einer aufgehellten Variante der neuen Farbe versehen. Sie k&ouml;nnen aber auch jede einzelne Polygonseite sowie die F&uuml;llung mit einer jeweils eigenen Farbe einf&auml;rben, indem Sie die f&uuml;r das jeweilige Teilobjekt gew&uuml;nschte Farbe &uuml;ber dessen eigenes Kontextmen&uuml; individuell einstellen.</p>
<br>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="3eck.htm">Dreieck</a></li>
<li><a href="neck.htm">N-Eck</a></li>
<li><a href="fillarea.htm">Fl&auml;che f&uuml;llen</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>