<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Probleme beim Programm-Start</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">

<A NAME="idh_prob_start"></A>

<H2>Probleme beim Programm-Start</H2>
<HR>

<P><B>a) Die Men&uuml;-Befehle sind teilweise deaktiviert:</B></P>

<P>Wenn Sie in der vorigen Sitzung eine andere als die Standard-Men&uuml;-Konfiguration geladen haben, dann wird diese beim erneuten Start ebenfalls wieder benutzt. Sofern Sie EUKLID DynaGeo nicht in einem Netz betreiben, in dem der Administrator das Programm so eingerichtet hat, dass Sie die Men&uuml;-Konfiguration nicht &auml;ndern d&uuml;rfen, k&ouml;nnen Sie unter dem Men&uuml;punkt "Verschiedenes | Einstellungen" eine andere Men&uuml;-Konfiguration w&auml;hlen.</p>
<br>

<P><B>b) Fehlermeldung: "Die Programmdatei wurde ver&auml;ndert."</B></P>

<P>Wenn EUKLID DynaGeo beim Programmstart nur diese Fehlermeldung zeigt und dann den Betrieb sofort wieder einstellt, dann ist Ihr Rechner in aller Regel <b>von einem Virus befallen</b>! Auch wenn es zun&auml;chst so aussieht, dass nur EUKLID DynaGeo diese Probleme macht und alle anderen Programme ordentlich laufen, kann ich Ihnen nur raten, diese Fehlermeldung <b>sehr, sehr ernst</b> zu nehmen. EUKLID DynaGeo geh&ouml;rt zu den wenigen Programmen, die beim Start die Integrit&auml;t der eigenen EXE-Datei &uuml;berpr&uuml;fen: nur wenn die EXE "im Originalzustand" ist, startet das Programm &uuml;berhaupt! </P>

<p>Falls Sie beim Start diese Fehlermeldung pr&auml;sentiert bekommen, dann checken Sie Ihren Rechner umgehend mit einem <b>aktuellen Virenscanner</b> durch. In den allermeisten F&auml;llen wird dabei der &Uuml;belt&auml;ter gefunden werden. Wie Sie dann weiter vorgehen, entnehmen Sie am besten der Hilfe zu Ihrer Anti-Viren-Software. Sollte kein Virus gefunden werden, hei&szlig;t das noch nicht unbedingt, dass auch keiner vorhanden ist! Seien Sie in diesem Fall in der Folgezeit besonders wachsam, um bei mysteri&ouml;sen Eigenaktivit&auml;ten Ihres Rechners rechtzeitig einschreiten zu k&ouml;nnen.</p>

<p>Auch wenn Ihre Anti-Viren-Software meldet, dass sie den Virus "beseitigt" und die befallenen Dateien "erfolgreich repariert" hat, kann es sein, dass DynaGeo nach wie vor nicht starten will: das Programm ist extrem intolerant gegen jegliche Ver&auml;nderung seiner EXE-Datei! Holen Sie sich aus dem Download-Bereich der <a href="http://www.dynageo.de/" target="_new">DynaGeo-Homepage</a> ein aktuelles Installationsarchiv, und installieren Sie das Programm in Ihr vorhandenes DynaGeo-Verzeichnis &uuml;ber die vorhandene Version dr&uuml;ber. Um sicher zu gehen, dass die alten Dateien dabei auch wirklich verschwinden, k&ouml;nnen Sie die alte DynaGeo.exe (und auch die Hilfedatei DynaGeo.chm) zuvor l&ouml;schen. Lassen Sie aber auf jeden Fall die Dateien mit den Kennungen ".ini" und ".dgl" unangetastet: sie enthalten Ihre pers&ouml;nlichen Einstellungen und Ihre Lizenzdaten!</p>
<br>

<p><font color="#FF0000"><b><i>Achtung!</i></b></font>
<ul>Eine wirklich <b>erfolgreiche Virensuche</b> setzt voraus, dass Sie zu den Zeiten, zu denen Ihr Rechner noch "clean" war, schon vorgesorgt haben: die meisten Anti-Viren-Programme gestatten die Herstellung einer <b>Boot-CD </b>, mit der der Rechner im Falle der Verseuchung gebootet werden kann, ohne dass irgend ein Virus aktiv werden kann. Eine solche Boot-CD kann aber notwendigerweise nur auf einem viren-freien System hergestellt werden! Der beste Schutz ist also (wie &uuml;blich) nur durch <b>aktive Vorsorge</b> zu erzielen. Die Behauptung "Mir wird schon nichts passieren!" hat noch nie jemanden wirklich gesch&uuml;tzt. Warten Sie nicht, bis der Ernstfall eintritt: dann k&ouml;nnte es zu sp&auml;t sein. Besorgen Sie sich rechtzeitig eine zuverl&auml;ssige Anti-Viren-Software, installieren Sie sie sorgsam, und halten Sie sie aktuell!</ul></p>
<br>
<br>
</FONT>
</BODY>
</HTML>