<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Punkt</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Konstruieren">
        <PARAM NAME="Keyword" VALUE="Punkte">
</OBJECT>

<A NAME="idh_cm_PCreate"></A>

<H2>Punkt&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/toolb201.gif" ALT="" BORDER=0></H2>
<HR>

<P><font size="-1">(<a HREF="JavaScript:HHCTRL.TextPopup(pop_autorepeat,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">automatisch wiederholbar</a>)</font></P>


<P>Ein Klick mit der linken Maustaste auf eine beliebige Stelle des Zeichenblattes erzeugt einen <I>Punkt</I>. Die Standardform f&uuml;r solche <A HREF="JavaScript:HHCTRL.TextPopup(pop_baseobj,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Basispunkte</A> ist ein schwarzes ausgef&uuml;lltes Quadrat.</P>

<P>Im <A HREF="JavaScript:HHCTRL.TextPopup(pop_contextmenu,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Kontext-Men&uuml;</A> eines Basispunktes finden Sie zus&auml;tzlich zu den Standardeintr&auml;gen die folgenden Befehle:
<ul>
<li><b>An Linie binden...</b> bzw. <b>Bindung aufheben</b> :<br>
Ist der Punkt frei, k&ouml;nnen Sie ihn mit dem Befehl <i>An Linie binden</i> an eine gerade Linie, einen Kreis, ein Polygon oder eine Ortslinie binden. Ist er schon gebunden, k&ouml;nnen Sie ihn mit <i>Bindung aufheben</i> wieder in einen freien Punkt zur&uuml;ckverwandeln.<br>
<br>
</li>
<li><b>Schrittweite...</b> :<br>
Wenn Sie diesen Men&uuml;eintrag anw&auml;hlen, erscheint ein Fenster, in dem Sie einstellen k&ouml;nnen, wie sich der Punkt beim Verziehen mit der Maus bewegen soll:<br>
<br>
<ul type=circle>
<li>m&ouml;glichst <b>kontinuierlich</b>, d.h.: <br>
der Punkt folgt der Maus pixel-genau;<br>
<br>
</li>
<li><b>in Spr&uuml;ngen</b> einstellbarer Gr&ouml;&szlig;e, d.h.: <br>
der Punkt folgt der Maus, indem er zum jeweils n&auml;chstgelegenen Gitterpunkt eines (virtuellen!) Rasters springt. In diesem Fall m&uuml;ssen Sie noch die <b>Schrittweite</b> (also: den Abstand der Rasterlinien) angeben. Wenn Sie z.B. die Schrittweite auf "1" stellen, hat der Punkt stets ganzzahlige Koordinaten.<br>
<br>
</li>
</ul>
Dieser Men&uuml;eintrag ist nur f&uuml;r ungebundene Basispunkte verf&uuml;gbar, sowie f&uuml;r an Funktions-Schaubilder gebundene Basispunkte. In letzterem Fall regelt die eingestellte Schrittweite nur die <b>horizontale</b> Bewegung des Punktes.<br>
<br>
</li>
<li><b>Fixieren</b> :<br>
damit k&ouml;nnen Sie einen Basispunkt in einen Punkt mit bestimmten Koordinaten umwandeln.<br>
<br>
</li>
<li><b>Spurpunkt setzen</b> :<br>
Dieser Men&uuml;punkt ist nur f&uuml;r ungebundene Basispunkte verf&uuml;gbar. Er erzeugt am aktuellen Ort des Basispunktes einen zus&auml;tzlichen Punkt mit festen Koordinaten. <br></li>
</ul>
</P>
<br>

<p>Falls Sie an m&ouml;glichst gro&szlig;em Bedienungskomfort interessiert sind, k&ouml;nnen Sie die Reichweite des Punkt-Befehls erheblich erweitern, so dass dieser auch Punkte auf Linien und sogar Schnittpunkte erzeugen kann. Die Details dazu finden Sie unter <a href="optintern.htm">"<i>Einstellungen</i> | <i>Internes</i>"</a> im Abschnitt "<i>Punkt-Befehl mit erweiterter Funktionalit&auml;t</i>".</p>
<br>
<br>
<p><b>ALT-Variante: Gitterpunkt</b><br>
<ul>Wenn Sie den Befehl <I>Punkt</I> &uuml;ber die Werkzeugleiste anw&auml;hlen und beim Klicken auf das entsprechende Icon die <I>ALT</I>-Taste gedr&uuml;ckt halten, dann wird statt eines gew&ouml;hnlichen Basispunktes ein neuer <b>Gitterpunkt</b> erzeugt, und zwar am Ort desjenigen Koordinatengitterpunktes, welcher der Mausklick-Position am n&auml;chsten liegt. Wenn Sie den so erzeugten Punkt danach mit der Maus verziehen, wird er von einem Gitterpunkt des Koordinatensystems zum n&auml;chsten h&uuml;pfen, und zwar unabh&auml;ngig davon, ob das Koordinatensystem sichtbar ist oder nicht. Der Gitterpunkt ist also ein Basispunkt, dessen "Schrittweite" gleich beim Erzeugen auf den Wert "1" gesetzt wird.</ul>
</P>

<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="ptonline.htm">Punkt auf einer Linie</a></li>
<li><a href="koordpunkt.htm">Punkt mit bestimmten Koordinaten</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>