<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Registrierung</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Lizenzbedingungen">
        <PARAM NAME="Keyword" VALUE="Lizenz">
</OBJECT>

<A NAME="idh_cm_Register"></A>

<H2>Nachtr&auml;gliche Lizenzierung einer Freeware-Installation</H2>
<HR>
<br>
<p>Ob Sie eine <b>lizenzierte Vollversion</b> von DynaGeo haben, die sich mit Ihren pers&ouml;nlichen Daten meldet, oder ob Sie "nur" eine <b>Freeware-Version</b> installiert haben, -- all das hat keinerlei Folgen f&uuml;r den Funktionsumfang des installierten Dynageo-Programms. Trotzdem k&ouml;nnten Sie den Wunsch haben, dass sich "Ihr DynaGeo" bei Ihnen auch als lizenzierte Vollversion zur Arbeit meldet statt als anonyme Freeware. Wie Sie das erreichen k&ouml;nnen, erfahren Sie hier: </p>

<P>Sie k&ouml;nnen Ihre pers&ouml;nlichen Lizenzdaten bei einer installierten Freeware-Version jederzeit <b>nachtr&auml;glich</b> eintragen, wenn Sie nur eine g&uuml;ltige DGL-Datei haben. Die einfachste Methode: <b>Kopieren Sie Ihre DGL-Datei ins EUKLID DynaGeo-Verzeichnis,</b> also z.B. "C:\Programme (x86)\DynaGeo\"). Dazu m&uuml;ssen Sie allerdings mit Administratorrechten angemeldet sein; als gew&ouml;hnlicher Benutzer haben Sie n&auml;mlich keine Schreibrechte in den Verzeichnissen, in denen Windows die Programme installiert! Wenn Sie Ihre DGL-Datei erfolgreich ins DynaGeo-Verzeichnis kopiert haben, sollte sich das Programm beim n&auml;chsten Start als lizenzierte Vollversion melden.</P>

<ul><font size="-1">Sie m&uuml;ssen diese Kopieraktion nicht unbedingt selbst durchf&uuml;hren. Soll EUKLID DynaGeo diese Arbeit f&uuml;r Sie erledigen, so w&auml;hlen Sie im <i>Hilfe-Men&uuml;</i> der Freeware-Version den Eintrag <i>Registrierung</i>; suchen Sie dann in dem Dialog-Fenster nach Ihrer DGL-Datei (mit dem Knopf <i>Durchsuchen</i>). Wenn das Editierfeld den vollst&auml;ndigen Pfad zu einer existierenden DGL-Datei enth&auml;lt, wird nach einem Klick auf den Knopf <i>Registrieren</i> eine Kopie dieser Datei ins EUKLID DynaGeo-Verzeichnis geschrieben. Wenn sich EUKLID DynaGeo beim n&auml;chsten Start als lizenzierte Vollversion meldet, wird der Men&uuml;punkt <i>Registrierung</i>  aus dem <i>Hilfe</i>-Men&uuml; entfernt: er ist ja nun auch nicht mehr n&ouml;tig!</font></ul>

<p>Da die DGL-Dateien inzwischen aber faktisch funktionslos sind, was den Betrieb des Programms zur Laufzeit angeht, bitte ich alle, die keine DGL-Datei mehr zur Verf&uuml;gung haben, sich mit der Freeware-Variante zufrieden zu geben. <b>Ich werde keine DGL-Dateien mehr versenden!</b></p>

<p>F&uuml;r den Umgang mit noch existierenden Lizenzdaten gilt weiterhin:<br>
</p>
<table>
<tr>
 <td width="10%"></td>
 <td border="2"><b><font color="#FF0000">Jede Weitergabe der installierten Vollversion bzw. der Lizenzdaten (also der DGL-Datei!) au&szlig;erhalb des Geltungsbereiches der jeweiligen Lizenz ist nach wie vor untersagt.</font></b> </td>
 <td width="10%"></td>
</tr>
</table>

<p>Von der <b>Archiv-Datei</b> hingegen d&uuml;rfen Sie beliebig viele Kopien herstellen und weitergeben, da sie lediglich eine Freeware-Version (ohne pers&ouml;nliche Lizenzdaten) enth&auml;lt. Einfacher ist es jedoch, wenn Sie nur die Homepage-Adresse von EUKLID DynaGeo weitergeben:</P>
<UL>
<P><B><a href="http://www.dynageo.de" target="_new">http://www.dynageo.de</a></B></P>
</UL>
<P>Dort kann sich jeder Interessent selbst eine Freeware-Version holen, von der er dann auch sicher sein kann, dass sie aktuell ist.</P>
<br>
<br>
</FONT>
</BODY>
</HTML>