<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Speichern unter</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Datei">
        <PARAM NAME="Keyword" VALUE="Zeichnung">
        <PARAM NAME="Keyword" VALUE="Speichern">
        <PARAM NAME="Keyword" VALUE="Exportieren">
</OBJECT>

<A NAME="idh_cm_SaveAs"></A>

<H2>Speichern unter...</H2>
<HR>

<P>Es wird ein Dialogfenster ge&ouml;ffnet, in dem Sie den (neuen) Namen der Datei eingeben k&ouml;nnen. Zu Ihrer besseren Orientierung wird auch hier eine Liste der schon vorhandenen <I>GEO</I>-Dateien angezeigt, aus der Sie auch einen Namen ausw&auml;hlen k&ouml;nnen. Stattdessen k&ouml;nnen Sie jedoch auch einen neuen Namen direkt ins Editierfeld <I>Dateiname</I> eingeben. Nach Ihrer Best&auml;tigung (<I>Okay</I>) wird die aktuelle Zeichnung in diese Datei geschrieben. Existiert schon eine Datei mit diesem Namen, werden Sie gefragt, ob sie &uuml;berschrieben werden soll. </P>

<P>Nach dem Abspeichern erscheint der neue Dateiname nun als der aktuelle Name Ihrer Zeichnung in der Kopfzeile.</P>

<P>Sie k&ouml;nnen in diesem Dialogfenster eine EUKLID DynaGeo - Zeichnung auch als Grafik-Datei abspeichern. Verf&uuml;gbar sind daf&uuml;r die Pixelformate <B><I>BMP</I></B>-, <B><I>JPG</I></B>- und <B><I>PNG</I></B>-, sowie die Vektorformate <B><I>WMF</I></B>- und <B><I>EMF</I></B>. W&auml;hlen Sie dazu in der Liste  <I>Dateityp</I> (unten) die passende Kennung des Formats. Dann wird Ihnen automatisch eine Liste der schon vorhandenen Grafik-Dateien dieses Typs angezeigt. Nach Eingabe bzw. Auswahl eines Dateinamens und einem Klick auf <i>Okay</i> wird die Grafik-Datei geschrieben. Falls Sie vor dem Aufruf des Dialogfensters einen <A HREF="JavaScript:HHCTRL.TextPopup(pop_selframe,popfont,10,10,-1,-1)" Title="Klicken Sie, um eine Definition zu sehen!">Auswahlrahmen</A> aufgezogen haben, wird nur der entsprechende Teil der Zeichnung in die Grafik-Datei geschrieben.</P>
<br>

<p><b>Bemerkungen:</b></p>
<ul>
<li>Wenn Sie die exportierte Grafik &uuml;bers Netz versenden oder in einer Web-Seite verwenden wollen, ist eine m&ouml;glichst kompakte Pixelgrafik vorteilhaft. In dieser Beziehung ist das <b>PNG-Format</b> zu empfehlen, das die derzeit wohl komprimierteste aller verf&uuml;gbaren verlustlosen Kodierungen aufweist und entsprechend zu den kleinsten Dateien f&uuml;hrt.<br>
<br>
</li>
<li>Wenn Sie beim Export einer Zeichnung als Grafik im Hinblick auf die sp&auml;tere Verwendung m&ouml;glichst keine Qualit&auml;tsverluste haben wollen, dann k&ouml;nnen Sie Ihre Konsturktion in einem Vektorformat (vorzugsweise im <b>EMF-Format</b>) abspeichern. Wenn Sie z.B. die Grafik in WORD einbinden und das Dokument sp&auml;ter ausdrucken, dann wird eine Pixelgrafik im Ausdruck immer nur diejenige Aufl&ouml;sung zeigen, die sie zum Zeitpunkt des Abspeicherns auf dem Bildschirm hatte; eine Vektorgrafik hingegen kann mit der vollen Aufl&ouml;sung des Druckers aufs Papier gebracht werden.<br>
<br>
</li>
<li>Wenn eine exportierte EMF-Grafik im aufnehmenden Programm jedoch nicht korrekt dargestellt wird, weil dieses Programm die Vektorgrafik teilweise nicht richtig "versteht", dann k&ouml;nnen Sie die Konstruktion doch in einem Pixelformat exportieren, aber die <b>Aufl&ouml;sung der Grafikdatei h&ouml;hersetzen</b>: dazu w&auml;hlen Sie unter "Einstellungen | Export" die gew&uuml;nschte Aufl&ouml;sung f&uuml;r den Export von Pixel-Bildern aus der dort angebotenen Liste aus. Damit steht dann sp&auml;ter (z.B. beim Ausdrucken) eine h&ouml;her aufgel&ouml;ste Grafik zur Verf&uuml;gung, was gar zu schlimme Qualit&auml;tsverluste vermeiden hilft.<br>
<br>
</li>
<li>Das fr&uuml;her noch verf&uuml;gbare <b><i>GEOX</i>-Format</b> ist inzwischen veraltet und wird nicht mehr zum Abspeichern von Zeichnungen verwendet. EUKLID DynaGeo kann allerdings nach wie vor alte Konstruktionen aus <i>GEOX</i>-Dateien einlesen und weiterbearbeiten. Beim Abspeichern der ge&auml;nderten Zeichnung m&uuml;ssen Sie dann allerdings das <b><i>GEO</i>-Format</b> benutzen. Falls die Zeichnung von einer schon bestehenden Web-Seite benutzt werden soll, muss in dieser der Dateiname im "&lt;object&gt;"-Tag entsprechend angepasst werden. <br>
<br>
</li>
</ul>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="savedgxpage.htm">Datei | Als DynaGeoX-HTML-Seite speichern...</a></li>
<li><a href="savedgjpage.htm">Datei | Als DynaGeoJ-HTML-Seite speichern...</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>