<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Tangente an eine Kurve</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Konstruieren">
        <PARAM NAME="Keyword" VALUE="Schaubild">
        <PARAM NAME="Keyword" VALUE="Tangente">
        <PARAM NAME="Keyword" VALUE="Normale">
        <PARAM NAME="Keyword" VALUE="Linien">
</OBJECT>

<A NAME="idh_cm_tangente"></A>

<H2>Tangente in einem Punkt an eine Kurve&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/tooltangente.gif" ALT="" BORDER=0></H2>
<HR>

<P>Dieser Befehl zeichnet die <b>Tangente</b> in einem gegebenen <b>Ber&uuml;hrpunkt</b> an eine <b>Kurve</b>.</p>

<p>Geben Sie zun&auml;chst den <b>Punkt auf der Kurve</b> an, in dem die Tangente die Kurve ber&uuml;hren soll. Falls EUKLID DynaGeo nicht schon jetzt erkennen kann, welche Kurve Sie meinen, erscheint in der Statuszeile (am unteren Fensterrand) ein Hinweis, dass Sie nun noch die <b>Kurve</b> anklicken m&uuml;ssen. Danach wird das entsprechende Tangenten-Objekt erzeugt und die Tangente angezeigt.</P>

<P>Der eingegebene Punkt muss schon existieren, und er muss auf der zu ber&uuml;hrenden Kurve liegen. Sie k&ouml;nnen dies zum Beispiel dadurch erreichen, dass Sie vor der Anwendung des "Tangenten"-Befehls einen Basispunkt erzeugen und an die Kurve binden. Als m&ouml;gliche Kurven kommen nahezu alle gebogenen Linien einer DynaGeo-Zeichnung in Frage: Kreise und Kreisb&ouml;gen, Kegelschnitte, Ortslinien und Funktions-Schaubilder.</P>

<p>Speziell bei <b>Tangenten an Funktions-Schaubilder</b> ist es h&auml;ufig w&uuml;nschenswert, dass man die x-Koordiante des Ber&uuml;hrpunktes der Tangente nachtr&auml;glich genau justieren kann. Zu diesem Zweck finden Sie im <b>Kontextmen&uuml;</b> eines (an einen Funktions-Graphen(!)) gebundenen Punktes einen zus&auml;tzlichen Eintrag:<br>
<ul>
<li><b>x-Koordinate editieren...</b><br>
Wenn Sie diesen Men&uuml;punkt anklicken, erscheint ein Fenster, das mit dem aktuellen Wert der x-Koordinate des gebundenen Punktes initialisiert wird. Geben Sie dann den gew&uuml;nschten neuen Wert ein. Ein Klick auf "OK" schlie&szlig;t das Fenster und schiebt den Punkt auf dem Funktions-Graphen an die gew&uuml;nschte Stelle.<br>
</li>
</ul>
<br>
<br>
</P>

<p><b>ALT-Variante: Normale in einem Punkt einer Kurve</b><br>
<ul>Wenn Sie den Befehl <I>Tangente an eine Kurve</I> &uuml;ber die Werkzeugleiste anw&auml;hlen und beim Klicken auf das entsprechende Icon die <I>ALT</I>-Taste gedr&uuml;ckt halten, dann erwartet der Befehl genau dieselben Eingabeobjekte, erstellt dann aber statt der Tangente die <b>Normale</b> auf die Kurve in dem gegebenen Kurvenpunkt. </ul>
</p>



<br>
<br>
</FONT>
</BODY>
</HTML>