<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Tastatur und Maus</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Grundlagen">
        <PARAM NAME="Keyword" VALUE="Tastatur">
        <PARAM NAME="Keyword" VALUE="Maus">
</OBJECT>

<A NAME="idh_cm_HelpKeyMouse"></A>

<H2>Tastatur und Maus</H2>
<HR>

<P>Wie f&uuml;r alle Windows-Anwendungen ist auch f&uuml;r EUKLID DynaGeo unbedingt eine Maus erforderlich. Das Programm kann (fast) vollst&auml;ndig &uuml;ber die Maus gesteuert werden. Die Tastatur ist nur zur Eingabe von Texten (z.B. Objektnamen oder Makro-Hilfetexten) n&ouml;tig. Allerdings k&ouml;nnen Men&uuml;befehle auch &uuml;ber die Tastatur ausgew&auml;hlt werden, was eventuell schneller gehen kann als die Auswahl mit der Maus.</P>

<ul>
<li><p>Die <b>linke Maustaste</b> dient wie &uuml;blich zur Anwahl von Men&uuml;punkten und Werkzeugen aus der Werkzeugleiste sowie zum Skalieren und Verschieben des Hauptfensters. Dar&uuml;berhinaus k&ouml;nnen mit ihr die geometrischen Objekte auf dem EUKLID DynaGeo - Zeichenblatt erzeugt, angew&auml;hlt und <a href="JavaScript:HHCTRL.TextPopup(pop_drag,popfont,10,10,-1,-1)" Title="Klicken Sie, um eine Definition zu sehen!">gezogen</a> sowie ein <a href="JavaScript:HHCTRL.TextPopup(pop_selframe,popfont,10,10,-1,-1)" Title="Klicken Sie, um eine Definition zu sehen!">Auswahlrahmen</a> erzeugt werden.</p></li>

<li><p>Ein <b>Doppelklick der linken Maustaste</b> auf ein schon vorhandenes Objekt &ouml;ffnet ein Fenster, in dem Sie diesem Objekt einen neuen Namen geben k&ouml;nnen (siehe auch <a href="objedit.htm"><i>Bearbeiten | Objekt benennen</i></a>). Ein Doppelklick auf einen Kommentartext ruft ein Editorfenster auf.</p></li>

<li><p>Wenn Sie mit der <b>rechten Maustaste</b> auf ein Objekt klicken, dann wird das <a href="JavaScript:HHCTRL.TextPopup(pop_contextmenu,popfont,10,10,-1,-1)" Title="Klicken Sie, um eine Definition zu sehen!">Kontext-Men&uuml;</a> dieses Objekt-Typs aufgerufen. Es dient zur Einstellung diverser Objekt-Parameter.<br>
Wenn Sie im Zugmodus an einer freien Stelle Ihrer Zeichnung rechts klicken, dann erscheint das <a href="JavaScript:HHCTRL.TextPopup(pop_contmenu_draw,popfont,10,10,-1,-1)" Title="Klicken Sie, um eine Definition zu sehen!">Kontextmen&uuml; der Zeichnung</a>.</p></li>
</ul>
<br>
<P>(Da Windows es erlaubt, die Maustasten zu vertauschen, gelten diese Aussagen f&uuml;r Linksh&auml;nder entsprechend umgekehrt.)</P>
<br>
<br>
<p><b><i>Siehe auch:</i></b>
<ul>
<li><a href="mousearrows.htm">Formen des Mauszeigers</a></li>
<li><a href="specialkeys.htm">Spezialtasten</a></li>
</ul>
</p>
<br>
<br>
</FONT>
</BODY>
</HTML>