<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Textbox einf&uuml;gen</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Textbox">
        <PARAM NAME="Keyword" VALUE="Konstruktionstext">
</OBJECT>

<A NAME="idh_cm_Comment"></A>

<H2>Textbox einf&uuml;gen&nbsp;&nbsp;&nbsp;&nbsp;<IMG SRC="../images/ToolTextbox2.gif" ALT="" BORDER=0></H2>
<HR>

<P>Dieser Befehl bringt ein Editier-Fenster zur Anzeige, in das Sie einen <B>beliebigen Text</B> eingeben k&ouml;nnen. W&auml;hrend der Eingabe stehen Ihnen die &uuml;blichen <b>Formatierungsoptionen</b> zur Verf&uuml;gung: Sie k&ouml;nnen Schriftart und Schriftgr&ouml;&szlig;e w&auml;hlen, den Text fett, kursiv und unterstrichen darstellen, und selbst tief- und hochgestellte Zeichen sind m&ouml;glich. Der Knopf "<i>Sonderzeichen</i>" hilft beim Einf&uuml;gen von h&auml;ufig gebrauchten griechischen Buchstaben und mathematischen Symbolen. Die <B>Abmessungen</B> der Textbox werden w&auml;hrend des Editierens festgelegt: die Textbox wird so gro&szlig;, dass sie den gesamten im Editierfenster stehenden Text fassen kann.</P>

<p>Nach dem Schlie&szlig;en des Editierfensters mit einem Klick auf <I>Okay </I> wird der eingegebene Text in Ihrer Zeichnung angezeigt. Sie k&ouml;nnen seine Position in Ihrer Zeichnung &auml;ndern, indem Sie ihn mit der Maus <A HREF="JavaScript:HHCTRL.TextPopup(pop_drag,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">verziehen</A>. Dar&uuml;berhinaus kann eine Textbox auch <a href="bindtext2obj.htm">an ein Objekt gebunden</a> werden, so dass sie dann allen Bewegungen dieses Objekts folgt.</p>

<P>Eine Textbox kann auch <B>nachbearbeitet</B> werden: ein Doppelklick mit der linken Maustaste auf den Text bringt wieder das Editierfenster zur Anzeige. Sie k&ouml;nnen den Text dann &auml;ndern oder die Breite neu einstellen. Achten Sie jedoch darauf, dass beim Schlie&szlig;en des Editierfensters der <u>gesamte Text</u> Ihrer Textbox zu sehen ist. Nur dann ist gew&auml;hrleistet, dass er auch in der Zeichnung vollst&auml;ndig angezeigt werden kann.</P>
<br>

<p>Im <b>Kontextmen&uuml;</b> einer Textbox finden Sie die folgenden Eintr&auml;ge:<br>
<ul>
<li><b>Verbergen </b>:<br>
<ul>Mit diesem Befehl k&ouml;nnen Sie eine Textbox genau so verbergen, wie jedes andere Objekt Ihrer Zeichnung auch.<br>
</ul><br>
</li>
<li><b>Farbe... </b>:<br>
<ul>Hiermit rufen Sie den Farbauswahl-Dialog auf, mit dessen Hilfe Sie die Farbe des Textes &auml;ndern k&ouml;nnen. Beachten Sie, dass es f&uuml;r den gesamten Text nur <u>eine</u> Farbe gibt.<br>
</ul><br>
</li>
<li><b>Editieren... </b>:<br>
<ul>Dieser Befehl erlaubt Ihnen nachtr&auml;gliche &Auml;nderungen des Textes. Er hat dieselbe Wirkung wie ein Doppelklick auf Ihren Text: es wird das Text-Eingabefenster aufgerufen und der aktuelle Text ins Editierfeld geladen.<br>
</ul><br>
</li>
<li><b>Textbox an Objekt binden...</b> bzw. <b>Bindung der Textbox aufheben</b> :<br>
<ul>Ist die Textbox noch frei, dann kann sie mit <i>Textbox an Objekt binden...</i> an ein beliebiges geometrisches Objekt Ihrer Zeichnung gebunden werden. Sie m&uuml;ssen dazu nur (mit der Maus) das Objekt anklicken, an das der Text gebunden werden soll. Eine schon gebundene Textbox k&ouml;nnen Sie mit <i>Bindung der Textbox aufheben</i> wieder in eine "freie" zur&uuml;ckverwandeln.<br>
</ul><br>
</li>
</ul>
</p>
<br>
<P><font color="#FF0000"><b><i>Achtung !</i></b></font>
<ul>
Textboxen k&ouml;nnen die Performance des Programms im Zugmodus deutlich verschlechtern. Setzen Sie sie daher sparsam und gezielt ein, und machen Sie sie nicht gr&ouml;&szlig;er als n&ouml;tig. (Eine Textbox kann zwar theoretisch sehr viele Zeichen enthalten, aber Sie sollten das nicht ausn&uuml;tzen.)
</P>
</ul>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="dynahelp.htm">Dynamisches Hilfefenster erstellen</a></li>
</ul>
</P>
<br>
</FONT>
</BODY>
</HTML>