<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">
<TITLE>Werkzeugleiste</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Grundlagen"/>
        <PARAM NAME="Keyword" VALUE="Werkzeugleiste"/>
</OBJECT>

<A NAME="idh_toolbar"></A>

<H2>Die Werkzeugleisten</H2>
<HR>

<P>Um den Zugriff auf h&auml;ufig gebrauchte Befehle zu erleichtern, verf&uuml;gt EUKLID DynaGeo &uuml;ber eine Werkzeugleiste: unter dem Hauptmen&uuml; erscheint eine Zeile mit kleinen Symbolbildern. Klickt man ein solches <B>Symbol</B> an, dann wird der zugeh&ouml;rige <B>Befehl</B> ausgef&uuml;hrt, gerade so, als w&auml;re er aus dem entsprechenden Men&uuml; gew&auml;hlt worden. Es gibt 6 verschiedene <B>Werkzeugpaletten</B>, zwischen denen Sie durch Klicken auf die Reiter am unteren Rand der Werkzeugleiste umschalten k&ouml;nnen:</P>
<br>
<ul>
<H3><a href="tool_mainbar.htm">die Hauptleiste</a></H3>
<ul>enth&auml;lt die wichtigsten Befehle aus den Men&uuml;s <i>Datei</i>, <i>Bearbeiten</i> und <i>Ansicht</i>;</ul>
<br>
<H3><a href="tool_konstruieren.htm">die Konstruieren-Leiste</a></H3>
<ul>enth&auml;lt die elementaren Befehle aus dem Men&uuml; <i>Konstruieren</i>;</ul>
<br>
<H3><a href="tool_abbilden.htm">die Abbilden-Leiste</a></H3>
<ul>enth&auml;lt Befehle aus dem Men&uuml; <i>Abbilden</i>;</ul>
<br>
<H3><a href="tool_curves.htm">die Kurven-Leiste</a></H3>
<ul>enth&auml;lt die Befehle aus dem Men&uuml; <i>Kurven</i>;</ul>
<br>
<H3><a href="tool_formfarbe.htm">die Form-&amp;-Farbe-Leiste</a></H3>
<ul>enth&auml;lt Hilfsmittel zum Editieren der Zeichnung. F&uuml;r ihre einzelnen Symbole gibt es keine direkt entsprechenden Men&uuml;befehle;</ul>
<br>
<H3><a href="tool_messrech.htm">die Messen-&amp;-Rechnen-Leiste</a></H3>
<ul>enth&auml;lt diejenigen Befehle, die sich auf Ma&szlig;-, Zahl- und Term-Objekte beziehen, sowie Befehle zur Manipulation von Punkt-Koordinaten.</ul>
<br>
<H3><a href="tool_animation.htm">die Animations-Leiste</a></H3>
<ul>schlie&szlig;lich enth&auml;lt Befehle, mit denen Sie Animationen Ihrer Zeichnung steuern k&ouml;nnen. Diese Leiste ist allerdings nur sichtbar, wenn Ihre Zeichnung f&uuml;r Animationen vorbereitet ist.</ul>
<br>
</ul>
<br>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="altcmds.htm">Verzeichnis der ALT-Befehle</a></li>
</ul>
<br>
<br>
</FONT>
</BODY>
</HTML>