<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Animations-Leiste</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Werkzeugleiste">
        <PARAM NAME="Keyword" VALUE="Animation">
</OBJECT>

<A NAME="idh_cm_ani"></A>

<H2>Die Animations-Leiste</H2>
<HR>

<P>Diese Leiste ist nur dann sichtbar, wenn Ihre Zeichnung geeignete <A HREF="JavaScript:HHCTRL.TextPopup(pop_anigear,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Animations-Steuerobjekte</A> enth&auml;lt. Andernfalls wird die Leiste komplett verborgen. Aber auch wenn sie angezeigt wird, kann sie eventuell zun&auml;chst nur den ersten der folgenden Befehle zeigen:</p>
<br>

<P><ul><IMG SRC="../images/toolb419.gif" ALT="" BORDER=0>   <a href="aniparams.htm">Animations-Parameter einstellen</a><br>
<br>
Ein Klick auf diesen Knopf f&uuml;hrt Sie zu einem Fenster, in dem Sie das <A HREF="JavaScript:HHCTRL.TextPopup(pop_anigear,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">Steuer-Objekt</A> f&uuml;r die Animation w&auml;hlen und den Startwert der Ablauf-Geschwindigkeit beeinflussen k&ouml;nnen.
</ul>
</P>
<br>
<P>
<ul>Nachdem Sie ein Steuer-Objekt f&uuml;r Ihre Animation gew&auml;hlt haben, werden zus&auml;tzlich die folgenden <b>Navigations-Befehle</b> verf&uuml;gbar:<br>
<br>
<IMG SRC="../images/navibtns.gif" ALT="" BORDER=0><br>
<br>
Diese Befehle arbeiten analog zu den Tasten eines Cassetten- oder Video-Recorders: mit den beiden gr&uuml;nen Pfeilen starten Sie die Animation (r&uuml;ckw&auml;rts oder vorw&auml;rts), ein Klick auf den mittleren (roten) Knopf h&auml;lt sie wieder an, und mit den beiden &auml;u&szlig;eren Kn&ouml;pfen springen Sie ganz an den Anfang bzw. an das Ende der Animation.
</ul>
</P>
<br>
Zur Laufzeit der Animation k&ouml;nnen Sie den Ablauf durch (kurzes!) Dr&uuml;cken der "Plus"- und "Minus"-Tasten im numerischen Ziffernblock Ihrer Tastatur <b>beschleunigen</b> oder <b>verlangsamen</b>; die "Mal"-Taste kehrt die Bewegungsrichtung der Animation um.<br>
<br>
<br>
<P><B><I>Siehe auch:</I></B>
<ul>
<li><a href="anibasics.htm">Grunds&auml;tzliches zu Animationen</a></li>
<li><a href="aniparams.htm">Animations-Parameter einstellen</a></li>
</ul>
</P>
<br>
<br>
</FONT>
</BODY>
</HTML>