<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" Content="text/html; charset=Windows-1252">

<OBJECT id=HHCTRL type="application/x-oleobject" classid="clsid:adb880a6-d8ff-11cf-9377-00aa003b7a11" >
</OBJECT>

<SCRIPT language=javascript SRC="eukldef.js">
</SCRIPT>

<TITLE>Details zu Winkeln</TITLE>
</HEAD>

<BODY BGCOLOR="#FFFFFF" TEXT="#000000">
<FONT FACE="ARIAL">
<OBJECT TYPE="application/x-oleobject" CLASSID="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e">
        <PARAM NAME="Keyword" VALUE="Winkel">
</OBJECT>

<A NAME="idh_AngleDetails"></A>

<H2>Weitere Details zu Winkeln</H2>
<HR>

<P>Sie k&ouml;nnen den <B>Radius des Winkelbogens</B> ver&auml;ndern, indem Sie im Zugmodus daran <A HREF="JavaScript:HHCTRL.TextPopup(pop_drag,popfont,10,10,-1,-1)"
Title="Klicken Sie, um eine Definition zu sehen!">ziehen</A>.</P>

<P>Ist der Winkel ein Rechter, wird er besonders <B>markiert</B>: statt des &uuml;blichen Winkelbogens wird ein rechtwinkliger <B>Haken</B> gezeigt. Falls Ihnen dies nicht zusagt und Sie die traditionelle Rechtwinkelmarkierung mit dem <B>Punkt</B> bevorzugen, m&uuml;ssen Sie in den <a href="optdarst.htm"><i>Einstellungen</i> auf der Registerkarte <i>Darstellung</i></a> die Option <i>"Rechten Winkel mit Punkt markieren"</i> anw&auml;hlen. Au&szlig;erdem k&ouml;nnen Sie hier einstellen, ob Sie <i>"Winkelmarkierungen gef&uuml;llt darstellen"</i> wollen oder nicht. Normalerweise ist diese Option markiert.</p>

<p> Auf der <a href="optintern.htm">Registerkarte <i>Internes</i></a> l&auml;sst sich dar&uuml;berhinaus noch einstellen, in welchem Intervall um den exakten rechten Winkel ein gegebener Winkel als Rechter angesehen wird.</P>

<P>Auf der <a href="optmeasure.htm">Registerkarte <i>Messen</i></a> k&ouml;nnen Sie w&auml;hlen, ob EUKLID DynaGeo die <B>Orientierung</B> eines Winkels ber&uuml;cksichtigen soll. Falls ja, wird von allen Winkeln, die Sie eingeben, angenommen, dass sie mathematisch positiv, also im Gegenuhrzeigersinn orientiert sind. So lassen sich auch &uuml;berstumpfe Winkel darstellen. Falls Sie die Orientierung der Winkel ausschalten, wird bei jedem eingegebenen Winkel die Reihenfolge der Schenkel automatisch so gew&auml;hlt, dass der Winkel nicht &uuml;berstumpf ist.</P>

<p>Wenn Sie Winkel gef&uuml;llt darstellen lassen, ist die F&uuml;llung eines Winkelbogens f&uuml;r die Maus unsichtbar. Damit haben Sie auf diese F&uuml;llung keinen direkten Zugriff mehr. Sie k&ouml;nnen jedoch die F&uuml;llfarbe eines Winkels ver&auml;ndern, indem Sie die Farbe des Winkel<u>bogens</u> ver&auml;ndern:<br>
<ul>
<li>wenn der Winkelbogen schwarz ist, dann wird das Segment gelb gef&uuml;llt;</li>
<li>wenn der Winkelbogen eine andere Farbe als schwarz hat, dann wird das Segment in einer helleren Variante dieser Farbe gef&uuml;llt.</li>
</ul>
Der "schwarz-gelbe Standardfall" stellt die einzige Ausnahme von dieser letzten Regel dar. Dies wurde so implementiert, weil ein "schwarz-grauer Standardfall" dann doch zu gar zu freudlosen Zeichnungen gef&uuml;hrt h&auml;tte <nobr>;-)</nobr></p>

<br>
<P><font color="#FF0000"><b><i>Achtung !</i></b></font>
<ul>
Winkelb&ouml;gen sind f&uuml;r EUKLID DynaGeo <B>keine Objekte</B>, d.h. sie k&ouml;nnen nicht als Eltern weiterer Objekte verwendet werden. Genau wie Namen, Ma&szlig;anzeigen und Textboxen dienen sie lediglich der Dekoration.</P>
</ul>
<br>
<br>
</FONT>
</BODY>
</HTML>